{
  "id": "e3ceaf8e-89d5-4f8a-9d36-2b0a3f36c1d8",
  "type": "item",
  "name": "Baccarat Chemin de Fer",
  "description": "A high-stakes card game featured prominently in Casino Royale, serving as the central plot device in Bond's confrontation with Le Chiffre.",
  "content": [
    {
      "title": "Overview",
      "body": "Baccarat Chemin de Fer is a variant of the baccarat card game, known for its fast pace and role in high-stakes gambling settings. In Ian Fleming's Casino Royale, this game forms the key battleground where James Bond challenges the villain Le Chiffre, making it pivotal to the story's tension and intrigue. The game represents the clash of wits, nerves, and luck in the espionage world."
    },
    {
      "title": "Rules and Gameplay",
      "body": "In Chemin de Fer, players take turns being the banker, offering the opportunity to build or fold bets, with the goal to obtain a hand value closest to nine. Unlike other baccarat variants, players can draw cards strategically, making it more interactive and reliant on skill and bluffing. The game's elegance and tension make it a natural choice for a suspenseful duel between Bond and Le Chiffre."
    },
    {
      "title": "Appearance",
      "body": "The game is typically played on a green baize table with multiple decks of cards and a distinctive layout for bets and stakes. Players are seated around the table, with chips placed precisely to represent bets. The dealer manages the pace, lending an atmosphere of sophistication and tension befitting a secret agent's mission setting."
    },
    {
      "title": "History",
      "body": "Originating in France during the mid-19th century, Chemin de Fer was popular among European aristocracy and casino-goers. Its blend of chance and player interaction made it a favored gambling game in elite circles. Ian Fleming selected it for Casino Royale to emphasize both the glamour and peril of Bond’s world, showcasing skill and nerve in gambling as metaphors for espionage."
    },
    {
      "title": "Story Significance",
      "body": "In Casino Royale, the baccarat game is not merely a pastime but a matter of life and death. Bond’s ability to outplay Le Chiffre at baccarat enables him to thwart the villain's plans financially and strategically, marking the narrative's climax. The game serves as a metaphor for Bond’s calculated risk-taking and reliance on both intellect and intuition in his missions."
    }
  ],
  "aliases": [
    "Chemin de Fer",
    "Baccarat",
    "Baccarat (Chemin de Fer variant)",
    "Casino Royale Card Game"
  ],
  "relationships": [
    {
      "type": "featured_in",
      "target": "9b1ab6a0-df91-4c86-8a72-8c23b7428298"
    },
    {
      "type": "associated_characters",
      "target": "e4f2568b-8c69-4e8a-9cf3-b12584970a29"
    },
    {
      "type": "associated_characters",
      "target": "4b751a8e-3dce-4f29-8b1a-4e7db45a98fe"
    }
  ],
  "properties": {
    "type": "Card Game",
    "origin": "France",
    "gameplay": "Player vs Player with bank rotation",
    "stakes": "High",
    "role": "Central plot device in Casino Royale"
  },
  "tags": [
    "gambling",
    "card game",
    "casino",
    "James Bond",
    "baccarat",
    "Chemin de Fer",
    "espionage"
  ]
}