{
  "id": "d1d75703-547e-4912-b4b9-c0f9312d7483",
  "type": "item",
  "name": "Walther PPK",
  "description": "James Bond's iconic compact pistol, favored for its reliability and concealability in Ian Fleming's Casino Royale.",
  "content": [
    {
      "title": "Overview",
      "body": "The Walther PPK is a small, semi-automatic pistol originally designed in Germany and renowned for its compact size and ease of concealment. In Ian Fleming’s Casino Royale, it is famously used as James Bond’s sidearm, symbolizing his professionalism, precision, and adaptability in espionage. The PPK became synonymous with Bond’s character, embodying a blend of elegance and lethality."
    },
    {
      "title": "Appearance",
      "body": "The Walther PPK is characterized by its sleek, streamlined, and minimalistic design, featuring a blued steel finish and lightweight frame. Its small grip and barrel length make it easy to conceal under clothing, with a classic and straightforward aesthetic. The gun is compact yet sturdy, appealing to agents requiring discretion combined with firepower."
    },
    {
      "title": "Function",
      "body": "Chambered typically in 7.65×17mm (.32 ACP), the Walther PPK is designed for self-defense and close-quarters combat. It is favored for its manageable recoil, reliable action, and ease of quick draw, making it ideal for covert operatives like Bond. In Casino Royale, it serves as Bond’s primary defensive tool, enabling him to confront threats both subtle and overt during high-stakes missions."
    },
    {
      "title": "History",
      "body": "The Walther PPK was introduced in 1931 in Germany as a version of the Walther PP series, designed for police and civilian use. Its association with espionage was bolstered dramatically through Ian Fleming’s novels, where Bond used it as his weapon of choice. Over time, the PPK became an emblematic firearm of British spy fiction and was popularized worldwide through the James Bond film franchise."
    },
    {
      "title": "Story Significance",
      "body": "In Casino Royale, the Walther PPK represents Bond’s readiness and professionalism as a secret agent. Its presence is a tangible signifier of Bond’s identity and mission focus, often enabling him to survive life-threatening situations. The pistol’s association with Bond has made it a cultural icon in spy fiction, reflecting themes of danger, control, and sophistication in Fleming’s storytelling."
    }
  ],
  "aliases": [
    "Walther PPK handgun",
    "PPK",
    "Walther PPK pistol",
    "Bond's PPK"
  ],
  "relationships": [
    {
      "type": "used_by",
      "target": "4b751a8e-3dce-4f29-8b1a-4e7db45a98fe"
    },
    {
      "type": "appears_in",
      "target": "9b1ab6a0-df91-4c86-8a72-8c23b7428298"
    }
  ],
  "properties": {
    "manufacturer": "Walther",
    "caliber": ".32 ACP (7.65 mm)",
    "type": "Semi-automatic pistol",
    "first_appearance": "Casino Royale (1953)",
    "use": "Concealed carry, espionage"
  },
  "tags": [
    "firearm",
    "weapon",
    "spy gear",
    "classic",
    "James Bond",
    "semi-automatic pistol"
  ]
}