{
  "id": "878e8ef7-cac7-4094-8b84-a5467a5248ed",
  "type": "character",
  "name": "Albert de Morcerf",
  "description": "Son of Fernand Mondego and Mercedes, a French nobleman and army officer in The Count of Monte Cristo.",
  "content": [
    {
      "title": "Background",
      "body": "**Albert de Morcerf** is the son of Fernand Mondego (later Count de Morcerf) and Mercédès, characters central to the narrative of *The Count of Monte Cristo*. Raised in a noble and wealthy family, Albert enjoys a privileged early life in Parisian society. His father, a former fisherman who rose to nobility by betraying Edmond Dantès, ensured Albert's aristocratic upbringing and education. Albert is a young French nobleman and a captain in the army, embodying the prestige and honor of his family name before the secrets of his father's past unravel."
    },
    {
      "title": "Personality",
      "body": "Albert is portrayed as honorable, kind-hearted, and naïve about his father's dishonorable past. He is brave, courteous, and values loyalty and family. Motivated by a desire to uphold his family name and live honorably, Albert's key flaw is his innocence and initial blindness to his father's moral failings. His idealism and trustfulness eventually lead to inner conflict when the truth about his father and Edmond Dantès surfaces."
    },
    {
      "title": "Story Role",
      "body": "Albert serves as a supporting character who illustrates the consequences of Edmond Dantès’ betrayal and revenge. He is a symbol of the next generation, initially unaware of the crimes that built his family's fortune. Throughout the story, Albert's arc moves from loyalty to shocked disillusionment, particularly after learning of his father's treachery. He also plays a role in the restoration of justice and reconciliation by ultimately siding with Edmond (the Count of Monte Cristo) after the truth emerges. Albert acts as a foil to Edmond and a vehicle for exploring themes of honor, family, and redemption."
    },
    {
      "title": "Relationships",
      "body": "- **Fernand Mondego (Count de Morcerf)**: Albert's father, a man who betrays Edmond Dantès to gain status.\n- **Mercédès**: Albert's mother, the devoted woman who loved Edmond before marrying Fernand.\n- **Edmond Dantès (The Count of Monte Cristo)**: Initially an enemy due to family history, Albert comes to respect and ally with Edmond after the truth is revealed.\n\nAlbert's relationships are complex, colored by the legacy of his father's past and Edmond's revenge, impacting his perception of loyalty and honor."
    },
    {
      "title": "Abilities",
      "body": "Albert is skilled in military tactics and horsemanship, fitting for his role as an army captain. He possesses noble etiquette, diplomacy, and leadership qualities appropriate to his social status. While not a fighter central to the action, his courage and integrity are notable traits."
    }
  ],
  "aliases": [
    "Count de Morcerf's son",
    "Albert de Morcerf"
  ],
  "relationships": [
    {
      "type": "related_to",
      "target": "4cd03369-18ad-427a-9a34-4f337f9c51c7"
    },
    {
      "type": "related_to",
      "target": "761d9e94-6294-472b-a35c-bbf470a6d510"
    },
    {
      "type": "related_to",
      "target": "5b178eaf-65ec-4c0d-8f34-93fab1c9b5f6"
    },
    {
      "type": "appears_in",
      "target": "3c6350b1-f92d-4f6a-a7e7-e82f61c57b13"
    }
  ],
  "properties": {
    "species": "human",
    "occupation": "army officer, nobleman",
    "born": "circa 1815",
    "portrayed_by": "Douglas Wilmer (1964 film), James O'Hara (BBC miniseries), Ed Stoppard (2002 film)"
  },
  "facets": {
    "role": "supporting",
    "morality": "heroic",
    "archetype": "warrior"
  },
  "tags": [
    "nobleman",
    "soldier",
    "character-from-the-count-of-monte-cristo",
    "19th-century",
    "french",
    "honor",
    "loyalty",
    "redemption",
    "military-tactics",
    "noble-ethics"
  ]
}