{
  "id": "660dbd00-d656-4b22-8c04-7200c277712d",
  "type": "character",
  "name": "Beryl Stapleton",
  "description": "Beryl Stapleton is a pivotal character in 'The Hound of the Baskervilles,' initially presented as the sister of Stapleton but later revealed to be his wife and a key figure in the Baskerville mystery.",
  "content": [
    {
      "title": "Background",
      "body": "Beryl Stapleton is introduced as the sister of the naturalist Stapleton, residing near the Baskerville estate on the desolate moor. However, as the narrative unfolds, it becomes clear that she is in fact Stapleton's wife, trapped in a controlling and deceitful relationship. Her background is marked by isolation and subjugation, living under her husband's ominous influence while secretly longing for freedom and safety from his manipulative schemes."
    },
    {
      "title": "Personality",
      "body": "Beryl comes across as gentle, vulnerable, and fearful, yet she exhibits moments of courage and defiance, especially when attempting to warn Sir Henry Baskerville about the dangers lurking on the moor. Her personality is a blend of meekness fostered by oppression and a spark of resilience that emerges as the story accelerates, highlighting her conflicted emotions and gradual awakening to the reality of her circumstances."
    },
    {
      "title": "Story Role",
      "body": "Beryl serves as both a victim and an informant in the mystery. She is key in revealing the true intentions of Stapleton and the method behind the legendary hound. Through her warnings and eventual confession, she helps Sherlock Holmes and Dr. Watson piece together the puzzle that unravels the myth of the supernatural beast threatening the Baskerville lineage."
    },
    {
      "title": "Relationships",
      "body": "Beryl's most significant relationship is with her husband, Stapleton, whose tyrannical and manipulative nature keeps her captive. She also develops a cautious but protective relationship with Sir Henry Baskerville, acting as an ally in his survival. Her interactions with Holmes and Watson are limited but crucial, as she ultimately aids their investigative efforts by providing critical testimony."
    },
    {
      "title": "Abilities/Skills",
      "body": "Beryl's main skills lie in her observational capabilities and her bravery to act despite personal danger. Although not a detective or an active investigator, her knowledge of the moor and insider awareness of Stapleton’s actions make her a valuable source of intelligence. Her ability to communicate coded warnings and her insight into her husband's schemes highlight a quiet but pivotal resourcefulness."
    }
  ],
  "aliases": [
    "Miss Stapleton",
    "Mrs. Stapleton",
    "Beryl"
  ],
  "relationships": [
    {
      "type": "appears_in",
      "target": "6c8b10a3-af96-4e41-82a1-3fdda8f234e8"
    }
  ],
  "properties": {
    "gender": "female",
    "role": "key witness and victim",
    "nationality": "English"
  },
  "facets": {
    "role": "supporting",
    "morality": "ambiguous",
    "archetype": "everyman"
  },
  "tags": [
    "the-hound-of-the-baskervilles",
    "arthur-conan-doyle",
    "sherlock-holmes",
    "victim",
    "moor",
    "mystery",
    "key-witness",
    "observant",
    "survivor"
  ]
}
