{
  "id": "ca7983bb-5f7b-4a04-b462-eedf8020c491",
  "type": "character",
  "name": "Calo Sanza",
  "description": "A witty and skilled member of the Gentleman Bastards, known for his sharp tongue and fearless demeanor.",
  "content": [
    {
      "title": "Background",
      "body": "Calo Sanza is one of the original members of the Gentleman Bastards, raised and trained under Father Chains's guidance in the criminal underbelly of Camorr. Born into poverty, Calo honed his skills from youth as a pickpocket and streetwise con man. He is the elder of the Sanza brothers and practically acts as a brotherly figure to his sibling Galdo as well as to Locke and the others in their close-knit criminal family."
    },
    {
      "title": "Personality",
      "body": "Calo is brash, bold, and often the voice of sarcastic humor among the Gentleman Bastards. He enjoys taunting foes and allies alike with his quick wit and sharp tongue, but beneath his jocular exterior lies unwavering loyalty and courage. His demeanor frequently serves as a counterbalance to Locke's more cerebral and serious nature, complementing the team dynamic by taking more direct action in moments of crisis."
    },
    {
      "title": "Story Role",
      "body": "Throughout 'The Lies of Locke Lamora', Calo is a constant and reliable presence in Locke's schemes and survival strategies. Not only does he participate actively in their cons and fights, but his brawn and brashness also come to the fore when their group faces physical challenges or direct confrontations with enemies. He often performs as both a protector and an instigator, pushing the group into action when hesitation threatens their plans."
    },
    {
      "title": "Relationships",
      "body": "Calo shares a deep bond with his younger brother Galdo Sanza, whom he often looks out for and sometimes rebukes with affectionate teasing. His relationship with Locke is one of close friendship and brotherhood, forged in hardship and cooperative deceit. As one of the Gentleman Bastards, Calo relates to all members closely and respects Father Chains as their mentor."
    },
    {
      "title": "Abilities/Skills",
      "body": "Calo is exceptional in close combat and physical confrontation, wielding blades and fists with practiced skill. His street smarts, agility, and fighting prowess make him a formidable opponent. Additionally, Calo is adept at improvisation and thrives in chaotic environments, making split-second decisions that often save the day. His confidence and fearlessness are as much an asset as his physical skills."
    }
  ],
  "aliases": [
    "Calo",
    "Sanza"
  ],
  "relationships": [
    {
      "type": "brother_of",
      "target": "884f1aaf-f9d8-42e5-9659-9d3ca5ed684b"
    },
    {
      "type": "companion_of",
      "target": "3f019f16-8ab2-48ce-8fbc-c9ed7ebc622a"
    }
  ],
  "properties": {
    "role": "Con Artist",
    "affiliation": "Gentleman Bastards",
    "combat_style": "Bladed weapons and brawling",
    "personality_traits": "Brash, witty, loyal",
    "origin": "Camorr"
  },
  "facets": {
    "role": "supporting",
    "morality": "heroic",
    "archetype": "rebel"
  },
  "tags": [
    "gentleman-bastards",
    "con-artist",
    "thief",
    "combatant",
    "brotherly-bond",
    "streetwise",
    "brash",
    "fearless",
    "camorr"
  ]
}