{
  "id": "3b407d4e-ffdb-42a2-8531-cf9f1e5d5640",
  "type": "franchise",
  "name": "Discworld",
  "description": "A long-running fantasy book series set on the Discworld, a flat planet supported on four elephants standing on a giant turtle, filled with satirical and magical adventures.",
  "content": [
    {
      "title": "Overview",
      "body": "Discworld is a sprawling comedic fantasy universe created by Terry Pratchett, consisting of over 40 novels and numerous short stories. The world itself is a flat disc balanced on the backs of four elephants who stand on the shell of the Great A’Tuin, a colossal turtle swimming through space. The series combines traditional fantasy motifs with sharp satire, addressing themes ranging from politics and religion to science and art, all peppered with British wit. The Discworld's diverse characters and settings reflect a rich mythology and multi-faceted society, making it a beloved and influential fantasy franchise."
    },
    {
      "title": "Setting and Worldbuilding",
      "body": "The Discworld itself is a fantastical flat world where magic is palpable and reality bends in humorously unexpected ways. The geography includes distinctive regions such as Ankh-Morpork, a bustling, corrupt city reminiscent of Victorian London, Lancre, a small kingdom filled with witches, and the Ramtops mountain range inhabited by dwarfs and trolls. The world’s mythology and cosmology are deeply detailed, with gods, undead, anthropomorphic personifications like Death, and creatures from folklore all playing pivotal roles. Magic and technology coexist in unpredictable ways, creating a dynamic and engaging environment."
    },
    {
      "title": "Themes and Style",
      "body": "Discworld novels are renowned for their satirical take on real-world issues, including bureaucracy, industrialization, power dynamics, and human folly. Pratchett’s style blends witty dialogue, puns, and footnotes with complex storytelling and character development. The series ranges from light-hearted comedies to darker, more philosophical books, often using fantasy as a lens to expose and critique human nature and society. The humor is often self-aware and meta-textual, breaking the fourth wall or playing with narrative conventions."
    },
    {
      "title": "Cultural Impact and Legacy",
      "body": "Discworld has garnered a devoted global fanbase and influenced fantasy literature significantly by combining humor with meaningful commentary. The series has been adapted into radio dramas, stage plays, graphic novels, and television series, broadening its reach. It helped popularize fantasy for adult audiences by demonstrating that the genre could address serious, topical issues humorously. Pratchett’s nuanced characters and world have inspired other authors, academics, and artists, cementing Discworld's place as a cornerstone of modern fantasy."
    },
    {
      "title": "Notable Characters and Subseries",
      "body": "Key recurring characters include Death, the anthropomorphic personification who evolves from a grim reaper figure into a more compassionate presence; Rincewind, a cowardly wizard; the Ankh-Morpork City Watch led by Sam Vimes; and the Lancre witches like Granny Weatherwax. The series is often grouped into subseries based on these characters or story arcs, providing diverse tones and perspectives across the franchise. Each subseries explores different facets of the Discworld, from political intrigue in Ankh-Morpork to folklore and magic in Lancre."
    }
  ],
  "aliases": [
    "Discworld Series",
    "The Discworld Novels",
    "Discworld Universe"
  ],
  "relationships": [
    {
      "type": "created_by",
      "target": "1a5b4a75-4e4e-4cb9-822a-111839b3cd45"
    },
    {
      "type": "includes",
      "target": "cb43e0db-3701-4a55-8470-9a2c4bcc8e6a"
    },
    {
      "type": "includes",
      "target": "cde6589e-4cc5-4613-bf53-d3f8826a42c3"
    },
    {
      "type": "includes_book",
      "target": "cb43e0db-3701-4a55-8470-9a2c4bcc8e6a"
    },
    {
      "type": "includes_book",
      "target": "cde6589e-4cc5-4613-bf53-d3f8826a42c3"
    }
  ],
  "properties": {
    "medium": "Books",
    "genre": "Fantasy, Satire",
    "first_published": 1983,
    "number_of_books": 41
  },
  "facets": {
    "genre": [
      "fantasy",
      "satire"
    ],
    "era": "1980s",
    "tone": [
      "comedic",
      "philosophical"
    ]
  },
  "tags": [
    "series",
    "magic",
    "british-literature",
    "humor",
    "worldbuilding",
    "meta-fiction",
    "social-satire",
    "fantasy-literature"
  ],
  "links": [
    {
      "url": "https://www.terrypratchettbooks.com/",
      "title": "Terry Pratchett Official Website",
      "type": "official"
    },
    {
      "url": "https://en.wikipedia.org/wiki/Discworld",
      "title": "Discworld - Wikipedia",
      "type": "wiki"
    }
  ]
}