{
  "id": "f1e5d2c3-b4a6-4c2e-8b23-9f5171d4e123",
  "type": "location",
  "name": "Doc Brown's Garage",
  "description": "The workshop of Dr. Emmett Brown, where the DeLorean time machine was built.",
  "content": [
    {
      "title": "History",
      "body": "Doc Brown's Garage is the makeshift laboratory of Dr. Emmett Brown, a brilliant but eccentric inventor. After being disowned by his family, Doc converted this space into his personal workshop where he developed numerous inventions, the most notable being the time-traveling DeLorean."
    },
    {
      "title": "Geography",
      "body": "The garage is located in Hill Valley, a small fictional town in California. It is attached to Doc Brown's family mansion, which was later destroyed in a fire, leaving only the garage intact."
    },
    {
      "title": "Notable Features",
      "body": "- The DeLorean Time Machine: The iconic vehicle used by Marty McFly and Doc Brown to travel through time.\n- Invention Tools: The garage is filled with various gadgets and gizmos that Doc uses to build and repair his inventions.\n- A variety of clocks, all precisely synchronized, emphasizing Doc's fascination with time."
    },
    {
      "title": "Story Significance",
      "body": "Doc Brown's Garage is crucial to the plot of *Back to the Future*. It is where Marty first witnesses the time machine in action and where the adventure begins. The garage serves as a hub for Doc's planning and invention work throughout the trilogy."
    }
  ],
  "aliases": [
    "Doc's Lab",
    "Emmett Brown's Lab"
  ],
  "relationships": [
    {
      "type": "featured_in",
      "target": "e0c661c3-9b71-4ef4-9ee7-cd23343f5b88"
    },
    {
      "type": "located_in",
      "target": "d4e5f6a7-b8c9-0123-def0-456789012345"
    },
    {
      "type": "contains",
      "target": "c3d4e5f6-a7b8-9012-cdef-345678901234"
    }
  ],
  "properties": {
    "fictional": true,
    "type": "building",
    "founded": "1885"
  },
  "tags": [
    "building",
    "sci-fi",
    "1985",
    "time travel",
    "Hill Valley"
  ]
}