{
  "id": "4cd03369-18ad-427a-9a34-4f337f9c51c7",
  "type": "character",
  "name": "Fernand Mondego",
  "description": "A nobleman and antagonist in The Count of Monte Cristo who betrays Edmond Dantès to marry Mercédès.",
  "content": [
    {
      "title": "Background",
      "body": "**Fernand Mondego** is the cousin of Mercédès and originally from humble origins. He was a fisherman from Marseille who desired to rise in social rank and marry Mercédès, the woman he loved since youth. His jealousy and ambition drive him to betray Edmond Dantès by falsely accusing him of being a Bonapartist traitor, leading to Edmond's imprisonment. Through this treachery, Fernand secures Mercédès and gains nobility, becoming a count and distinguished soldier."
    },
    {
      "title": "Personality",
      "body": "- Ambitious and socially ambitious\n- Jealous and envious, especially toward Edmond Dantès\n- Ruthless and willing to betray to achieve his goals\n- Proud and militaristically accomplished\n- Ultimately haunted by guilt and downfall\n\nHis motivations are driven largely by love and envy, but his paranoia and cruelty grow as he ascends in status."
    },
    {
      "title": "Story Role",
      "body": "Fernand serves as a primary antagonist to Edmond Dantès (The Count of Monte Cristo). He functions as a foil, representing the corrupt nobility and betrayal Edmond seeks to destroy in his quest for revenge. Fernand’s arc follows his rise from poor fisherman to count through treachery and his ultimate downfall when The Count reveals his crimes and disgraces him publicly. His betrayal catalyzes Edmond’s transformation and sets much of the narrative in motion."
    },
    {
      "title": "Relationships",
      "body": "- **Mercédès**: Cousin and later wife; love interest who ultimately remains loyal to Edmond at heart.\n- **Edmond Dantès**: Rival and victim of Fernand's betrayal; his betrayal of Edmond defines much of his character.\n- **Albert de Morcerf**: Son, whose honor is threatened by Fernand’s past.\n- **Others**: Fernand is intertwined with the French aristocracy and military, reflecting his acquired noble status."
    }
  ],
  "relationships": [
    {
      "type": "related_to",
      "target": "761d9e94-6294-472b-a35c-bbf470a6d510"
    },
    {
      "type": "rivals_with",
      "target": "5b178eaf-65ec-4c0d-8f34-93fab1c9b5f6"
    },
    {
      "type": "related_to",
      "target": "878e8ef7-cac7-4094-8b84-a5467a5248ed"
    },
    {
      "type": "appears_in",
      "target": "3c6350b1-f92d-4f6a-a7e7-e82f61c57b13"
    }
  ],
  "properties": {
    "species": "human",
    "occupation": "Nobleman, Military officer",
    "born": "circa 1790",
    "died": "circa 1844"
  },
  "facets": {
    "role": "antagonist",
    "morality": "villainous",
    "archetype": "ruler"
  },
  "tags": [
    "human",
    "nobleman",
    "jealous",
    "betrayer",
    "the-count-of-monte-cristo",
    "19th-century",
    "social-climbing",
    "military-officer",
    "envy",
    "ambitious"
  ],
  "aliases": [
    "Fernand",
    "Count de Morcerf"
  ]
}