{
  "id": "6d847670-eb47-4a1b-b0e8-2fa2f9ffdccf",
  "type": "location",
  "name": "Goblin-town",
  "description": "Goblin-town is the dark, underground lair of the goblins beneath the Misty Mountains, infamous for its labyrinthine tunnels and hostile inhabitants.",
  "content": [
    {
      "title": "Overview",
      "body": "Goblin-town is a subterranean settlement located deep beneath the Misty Mountains, serving as the central stronghold and home of the goblins (also called orcs). It is a sprawling network of caverns and tunnels, notoriously filthy and dangerous. The town operates ominously under the rule of the Great Goblin, and it is characterized by its chaotic, oppressive atmosphere, filled with the constant threat of violence and treachery among its denizens."
    },
    {
      "title": "Appearance",
      "body": "Goblin-town consists of a maze-like series of dark and damp chambers hollowed out by the goblins beneath the mountain ranges. The environment is rocky and uneven, illuminated only by crude torches and cavern fires. The architecture is primitive, made from scavenged materials and primitiveshaped stone, emphasizing utility over aesthetics. It is rife with traps, narrow passages, and holding pits for prisoners, embodying complete inhospitability to outsiders."
    },
    {
      "title": "History",
      "body": "For centuries, Goblin-town has been a stronghold for the goblins who infest the Misty Mountains, serving as their base for raids and ambushes on travelers. Its dark influence contributes to the perilous nature of the surrounding mountains and pathways. The goblins are feared by many races, and the town remains untouched and hidden from the surface. During Thorin’s company journey, the group is captured here, leading to a pivotal escape aided by Gandalf."
    },
    {
      "title": "Story Significance",
      "body": "Goblin-town represents one of the earliest grave dangers faced by the protagonists in 'The Hobbit.' The capture and imprisonment of the company in its depths showcase the hazards that lurk in Middle-earth’s underworld. The escape from Goblin-town precipitates a series of dramatic events, including Gandalf’s duel with the Great Goblin. The location highlights the dark, menacing forces opposing the quest and adds to the heroic narrative of perseverance."
    }
  ],
  "aliases": [
    "The Great Goblin's Lair",
    "Goblin Caves",
    "Misty Mountains Goblin Stronghold"
  ],
  "relationships": [
    {
      "type": "enemy_habitat",
      "target": "e3ec530a-1eec-4f22-bac9-d00f8e0a3b6a"
    }
  ],
  "properties": {
    "type": "Underground Settlement",
    "inhabitants": "Goblins/Orcs",
    "location": "Beneath the Misty Mountains",
    "notable_ruler": "Great Goblin",
    "danger_level": "Extreme"
  },
  "facets": {
    "location-type": "building",
    "reality": "fictional",
    "scale": "building"
  },
  "tags": [
    "middle-earth",
    "goblin",
    "misty-mountains",
    "the-hobbit",
    "underground",
    "enemy-territory",
    "labyrinthine",
    "dark",
    "hostile",
    "oppressive-atmosphere"
  ]
}