{
  "id": "319a784a-8e43-4dfb-93e4-2b484576bc0b",
  "type": "location",
  "name": "Goldfinger's Factory",
  "description": "The industrial facility where Auric Goldfinger manufactures and stores his illicit gold and executes his nefarious plans.",
  "content": [
    {
      "title": "Overview",
      "body": "Goldfinger's Factory is a large, heavily guarded industrial complex dedicated primarily to the production and storage of gold. The factory not only acts as a legitimate business front for Auric Goldfinger's wealth but also houses a secret vault where sophisticated gold smelting and refining processes occur. The location leverages a combination of heavy security, strategic isolation, and technological countermeasures to protect its valuable contents."
    },
    {
      "title": "Appearance",
      "body": "Externally, the factory is an expansive, utilitarian structure composed of concrete and steel, optimized for function rather than form. It contains multiple warehouses, a refining plant, and extensive security installations including watchtowers, alarms, and restricted access zones. Inside, the facility is a labyrinth of conveyor belts, melting furnaces, and storage vaults, filled with the distinct gleam of gold bars and nuggets."
    },
    {
      "title": "History",
      "body": "The factory was established by Auric Goldfinger as a legitimate front for his wealth accumulation but quickly evolved into a hub for his criminal enterprises, including gold smuggling and money laundering. It played a crucial role in his ambitious plan to destabilize the global economy by detonating a nuclear device at Fort Knox, thereby monopolizing the United States gold supply."
    },
    {
      "title": "Story Significance",
      "body": "Goldfinger's Factory serves as a primary setting for key confrontations in the James Bond universe, most notably in the film and novel 'Goldfinger.' It symbolizes the fusion of legal business operation and criminal activity, highlighting the antagonist's greed and ruthlessness. The factory's security and operations challenge Bond's espionage skills and contribute to the narrative tension."
    }
  ],
  "aliases": [
    "Goldfinger's Refinery",
    "Goldfinger Plant",
    "Auric Goldfinger's Industrial Complex"
  ],
  "relationships": [
    {
      "type": "located_in",
      "target": "a852c3e2-ba7d-4c5c-8a10-137e4d321152"
    }
  ],
  "properties": {
    "security_level": "High",
    "primary_industry": "Gold refining and storage",
    "associated_character": "Auric Goldfinger",
    "appearance_in": [
      "Goldfinger (movie)",
      "Goldfinger (novel)"
    ],
    "location_type": "Industrial Complex"
  },
  "facets": {
    "location-type": "structure",
    "reality": "fictional",
    "scale": "building"
  },
  "tags": [
    "james-bond",
    "goldfinger",
    "industrial",
    "criminal-base",
    "gold-refinery",
    "spy-fiction",
    "security",
    "vault",
    "espionage",
    "mafia"
  ],
  "links": [
    {
      "url": "https://jamesbond.fandom.com/wiki/Goldfinger%27s_Factory",
      "title": "Goldfinger's Factory - James Bond Wiki",
      "type": "fan-wiki"
    }
  ]
}