{
  "id": "5b5d9c8f-684a-45a4-b746-5c03520caa18",
  "type": "location",
  "name": "Hampstead Heath",
  "description": "A large, ancient London parkland featured prominently in espionage activities in John le Carré's 'Smiley’s People'.",
  "content": [
    {
      "title": "Overview",
      "body": "Hampstead Heath is a vast and historic expanse of woodland, meadows, and ponds located in North London. In 'Smiley’s People', it serves as a tranquil yet significant backdrop for key espionage encounters, reflecting the juxtaposition of ordinary English life with covert intelligence operations."
    },
    {
      "title": "Appearance",
      "body": "The location is characterized by rolling grassy areas, dense clusters of trees, and several serene ponds. Its undulating terrain and secluded spaces make it an ideal rendezvous point for secret meetings away from the busy bustle of London city life."
    },
    {
      "title": "History",
      "body": "Hampstead Heath has a rich history as a common land used by Londoners for recreation since medieval times. In the context of 'Smiley’s People', it is imbued with Cold War era espionage tension, standing as a neutral ground where characters confront past loyalties and underground conflicts."
    },
    {
      "title": "Story Significance",
      "body": "The Heath acts as a crucial location for George Smiley and other operatives in their investigations, symbolizing both the beauty of normal life and the murky shadows of espionage. It also represents a liminal space where personal secrets and political intrigue collide."
    }
  ],
  "aliases": [
    "Hampstead Heath Park",
    "The Heath"
  ],
  "relationships": [
    {
      "type": "featured_in",
      "target": "32c5d5e9-2e8f-43f3-982d-9846bc4a1450"
    }
  ],
  "properties": {
    "country": "United Kingdom",
    "city": "London",
    "type": "Urban park",
    "area": "Approximately 790 acres"
  },
  "facets": {
    "location-type": "landscape",
    "reality": "real",
    "scale": "neighborhood"
  },
  "tags": [
    "park",
    "london",
    "cold-war",
    "espionage",
    "le-carre",
    "smiley's-people",
    "literary-setting",
    "secret-meetings",
    "historic"
  ],
  "links": [
    {
      "url": "https://en.wikipedia.org/wiki/Hampstead_Heath",
      "title": "Hampstead Heath - Wikipedia",
      "type": "wiki"
    }
  ]
}