{
  "id": "a1d9f0c7-758c-4b8d-a6f7-e2b12858e1c2",
  "type": "location",
  "name": "Isle of Monte Cristo",
  "description": "A remote island in the Mediterranean Sea, holding the hidden treasure in The Count of Monte Cristo.",
  "content": [
    {
      "title": "History",
      "body": "**Isle of Monte Cristo** is a fictional island featured in Alexandre Dumas's novel *The Count of Monte Cristo*. It is renowned for being the secret location of a vast treasure hidden by an Italian priest and scholar, Abbé Faria. The treasure is later discovered by Edmond Dantès after his escape from imprisonment. The island plays a crucial role in the story's unfolding of Edmond's transformation into the Count of Monte Cristo and his quest for vengeance and justice."
    },
    {
      "title": "Geography",
      "body": "The island is described as a rocky and isolated isle located in the Mediterranean Sea. It is uninhabited and difficult to access, which makes it an ideal hiding place for the treasure. The terrain includes rocky cliffs and natural fortifications that conceal the cavern containing the treasure."
    },
    {
      "title": "Notable Features",
      "body": "- **Treasure Cavern**: A secret cave where the fortune of the Spada family is hidden.\n- **Natural Rocky Landscape**: The rugged nature of the island serves as a natural defense.\n- **Absence of Inhabitants**: The island is deserted, enhancing its secrecy."
    },
    {
      "title": "Story Significance",
      "body": "The Isle of Monte Cristo serves as the pivotal physical location for Edmond Dantès's transformation from a falsely imprisoned sailor into the wealthy and influential Count of Monte Cristo. It is upon this island that Dantès uncovers the stolen treasure, enabling him to execute his elaborate plans of revenge and redemption. The island symbolizes secrecy, rebirth, and the acquisition of power."
    }
  ],
  "properties": {
    "fictional": true,
    "type": "region",
    "population": 0,
    "founded": null
  },
  "relationships": [
    {
      "type": "featured_in",
      "target": "3c6350b1-f92d-4f6a-a7e7-e82f61c57b13"
    }
  ],
  "facets": {
    "location-type": "region",
    "reality": "fictional",
    "scale": "region"
  },
  "tags": [
    "classic-literature",
    "adventure",
    "hidden-treasure",
    "mediterranean-sea",
    "rocky-island",
    "secrecy",
    "dumas",
    "count-of-monte-cristo"
  ],
  "links": [
    {
      "url": "https://en.wikipedia.org/wiki/The_Count_of_Monte_Cristo",
      "title": "The Count of Monte Cristo - Wikipedia",
      "type": "wiki"
    }
  ]
}