{
  "id": "6c3edb3b-1c68-4f0f-9ed9-952d3e7acb6e",
  "type": "person",
  "name": "J.R.R. Tolkien",
  "description": "English writer, philologist, and professor best known for creating the Middle-earth legendarium.",
  "content": [
    {
      "title": "Biography",
      "body": "John Ronald Reuel Tolkien was born in 1892 in Bloemfontein, Orange Free State, and became one of the most influential fantasy authors of the 20th century. A scholar of Old and Middle English, he served in World War I and later worked as a professor of Anglo-Saxon at Oxford University. His life was marked by his deep academic interests and his devotion to creating rich mythical worlds."
    },
    {
      "title": "Career",
      "body": "Tolkien began his career primarily as an academic before gaining worldwide fame as a fantasy author. His early works included translations and studies of medieval literature, but eventually, his imaginary mythology, featuring Elves, Dwarves, and other races, became his hallmark. His books, including The Hobbit and The Lord of the Rings trilogy, were seminal in establishing modern fantasy literature."
    },
    {
      "title": "Notable Works",
      "body": "Tolkien's most celebrated works are The Hobbit (1937) and The Lord of the Rings trilogy (1954-1955), which consists of The Fellowship of the Ring, The Two Towers, and The Return of the King. Additionally, The Silmarillion, published posthumously, provides the foundational mythology of Middle-earth. These works are recognized for their detailed world-building, complex languages, and rich histories."
    },
    {
      "title": "Style and Influence",
      "body": "Tolkien's style is characterized by poetic prose, mythic themes, and a deep respect for languages and folklore. His scholarly expertise informed the languages he invented, which underpin his narrative worlds. His influence extends beyond literature into films, games, and popular culture, inspiring generations of fantasy writers and creators."
    },
    {
      "title": "Legacy",
      "body": "Tolkien passed away in 1973, but his legacy endures with millions of readers worldwide. His works have been translated into numerous languages and adapted into blockbuster films and various media. He is often regarded as the father of modern fantasy literature, and his scholarly and creative contributions remain a landmark of 20th-century writing."
    }
  ],
  "aliases": [
    "John Ronald Reuel Tolkien",
    "Professor Tolkien",
    "Tolkien"
  ],
  "relationships": [
    {
      "type": "creator_of",
      "target": "dbd93414-7d92-4a6c-9370-7a316e89d9ae"
    },
    {
      "type": "creator_of",
      "target": "3f2a8ac1-8265-4be2-b147-af56f003de51"
    },
    {
      "type": "author_of",
      "target": "84e7f1c5-bebb-48e2-a6e2-652ada2e67a4"
    },
    {
      "type": "wrote",
      "target": "84e7f1c5-bebb-48e2-a6e2-652ada2e67a4"
    }
  ],
  "properties": {
    "birth_year": 1892,
    "death_year": 1973,
    "nationality": "British",
    "occupation": "Author, Philologist, Professor"
  },
  "facets": {
    "profession": [
      "author",
      "philologist",
      "professor"
    ],
    "active-era": "20th-century",
    "nationality": "british"
  },
  "tags": [
    "fantasy",
    "middle-earth",
    "literature",
    "mythology",
    "language-creation",
    "medieval-studies",
    "world-building",
    "oxford-university",
    "scholarship"
  ]
}