{
  "id": "5f7e92e6-2291-4741-8691-252c88e411fe",
  "type": "person",
  "name": "Joe Mantegna",
  "description": "American actor known for his role as Joey Zasa in The Godfather Part III.",
  "content": [
    {
      "title": "Biography",
      "body": "Joe Mantegna was born on November 13, 1947, in Chicago, Illinois. Growing up in a working-class Italian-American family, he pursued acting at a young age and trained in various theater companies, developing a strong foundation in stage acting. His Italian heritage and versatile talent led him to numerous prominent roles in film and television."
    },
    {
      "title": "Career",
      "body": "Mantegna's career has been distinguished by his ability to portray tough, complex characters across both comedic and dramatic genres. He earned acclaim for his role as Joey Zasa in The Godfather Part III, a ruthless gangster challenging Michael Corleone's authority. He is also notable for long-running roles, such as FBI agent David Rossi on the TV series Criminal Minds, showcasing his range and enduring presence in entertainment."
    },
    {
      "title": "Notable Works",
      "body": "Besides The Godfather Part III, Joe Mantegna has appeared in films such as The Godfather Part II (in a minor role), House of Games, Searching for Bobby Fischer, and the voice of Fat Tony in The Simpsons. His stage performances, especially in David Mamet's plays, earned critical praise, cementing his reputation as a respected character actor."
    },
    {
      "title": "Style and Influence",
      "body": "Known for his nuanced portrayals of Italian-American characters, Mantegna brings authenticity and depth to his roles. His commanding presence and distinctive voice have made him a memorable figure in mob-related narratives. Outside of crime dramas, his work reflects a commitment to theatrical arts, influencing both screen and stage performances."
    }
  ],
  "aliases": [
    "Joseph Anthony Mantegna",
    "Joey Zasa Actor",
    "Joe"
  ],
  "relationships": [
    {
      "type": "appears_in",
      "target": "a34e10f7-2f77-48bd-803f-efa34f19c87f"
    },
    {
      "type": "colleague",
      "target": "f571c85e-fd0f-448a-a9f3-64c9e8c3d36f"
    },
    {
      "type": "colleague",
      "target": "9ade6ec2-703e-425c-8abe-8a6a5a3fbe55"
    },
    {
      "type": "starred_in",
      "target": "d5f5bf96-6e3b-4d6f-b32b-32b91a67b1c8"
    },
    {
      "type": "starred_in",
      "target": "c4da1933-fd4a-4d12-b162-56aa2b8fab63"
    }
  ],
  "properties": {
    "birth_date": "1947-11-13",
    "nationality": "American",
    "occupation": "Actor",
    "active_years": "1969–present",
    "notable_tv_roles": "Criminal Minds"
  },
  "facets": {
    "profession": [
      "actor"
    ],
    "active-era": "1970s",
    "nationality": "american"
  },
  "tags": [
    "the-godfather-part-iii",
    "gangster-roles",
    "chicago",
    "stage-actor",
    "italian-american",
    "mob-actor",
    "character-actor",
    "crime-drama",
    "fbi"
  ]
}