{
  "id": "d75919c5-7c9a-4c67-b80a-9f1a6c9d5ef2",
  "type": "location",
  "name": "Kalgan (Second Foundation)",
  "description": "Kalgan is a crucial planet in the Foundation universe, serving as a stronghold and power base for the Second Foundation.",
  "content": [
    {
      "title": "Overview",
      "body": "Kalgan is a planet of strategic and military significance in Isaac Asimov's Foundation series. Known for its strong fortifications and industrial capacity, it serves as the seat of power for factions opposing the original Foundation, notably the Second Foundation in certain narrative contexts."
    },
    {
      "title": "Appearance",
      "body": "Kalgan is depicted as a harsh and militarized world with sprawling fortresses and battle-scarred terrain. Its urban areas are heavily industrialized, designed primarily for defense and sustained conflict, contrasting with more peaceful or commercially oriented planets."
    },
    {
      "title": "History",
      "body": "Throughout the series, Kalgan rose to prominence under the leadership of the warlord known as the Mule, who used it as a base to challenge the Foundation's authority. Later, it also becomes associated with the clandestine activities and covert operations of the Second Foundation."
    },
    {
      "title": "Story Significance",
      "body": "Kalgan plays a pivotal role in the power struggles that shape the galactic order, embodying the tension between overt military might and the subtle manipulations of the Second Foundation. Its presence underlines themes of control, resistance, and the hidden hand guiding the galaxy’s future."
    },
    {
      "title": "Relationship to Second Foundation",
      "body": "In later developments of the series, Kalgan is linked to the secretive Second Foundation, which uses its facilities for intelligence and psychological manipulation. The planet thus symbolizes the shadow war between visible empires and unseen controllers."
    }
  ],
  "aliases": [
    "Kalgan Planet",
    "Kalgan Stronghold"
  ],
  "relationships": [
    {
      "type": "home_of",
      "target": "478a780d-5633-44ed-beab-55a3c19c8f03"
    },
    {
      "type": "located_in",
      "target": "a8f3d2e1-5b6c-4d9e-8f7a-1c2b3d4e5f6a"
    },
    {
      "type": "featured_in",
      "target": "00d6ad61-e1ae-47cd-b217-a30af0b9f508"
    }
  ],
  "properties": {
    "type": "Military Planet",
    "population": "High Military Concentration",
    "government": "Military Dictatorship"
  },
  "facets": {
    "location-type": "planet",
    "reality": "fictional",
    "scale": "planet"
  },
  "tags": [
    "foundation-universe",
    "military",
    "power-struggle",
    "stronghold",
    "industrial",
    "isaac-asimov",
    "militarized",
    "second-foundation"
  ],
  "links": [
    {
      "url": "https://foundation.fandom.com/wiki/Kalgan",
      "title": "Kalgan - Foundation Wiki",
      "type": "fan-wiki"
    },
    {
      "url": "https://en.wikipedia.org/wiki/Foundation_(Asimov_series)#Kalgan",
      "title": "Foundation (Asimov series) - Wikipedia (Kalgan section)",
      "type": "wiki"
    }
  ]
}