{
  "id": "ecf87b10-d3f5-4832-9c1a-3e1bfaea6abc",
  "type": "location",
  "name": "Los Angeles",
  "description": "Los Angeles is a major city in California known for its significant role in movies and television production.",
  "content": [
    {
      "title": "Overview",
      "body": "Los Angeles, commonly referred to as LA, is a large city located in Southern California. It is well-known as the entertainment capital of the world and is primarily known for its significant role in the global film and television industry. Los Angeles is home to Hollywood, which is the heart of the American film industry."
    },
    {
      "title": "Film History",
      "body": "Many notable movies and television shows have been filmed in Los Angeles, taking advantage of its diverse landscapes and iconic cityscapes. The city itself frequently doubles for other locations in films. LA has hosted filming for movies like 'La La Land', 'Pulp Fiction', and 'Blade Runner'. Notable film locations within the city include the Hollywood Sign, Griffith Observatory, and Santa Monica Pier."
    },
    {
      "title": "Visiting",
      "body": "Los Angeles is open to the public and offers various tours, including studio tours at Warner Bros. Studios and Universal Studios Hollywood. These tours allow visitors to see behind the scenes of film production. The city is also home to world-renowned museums, beaches, and a vibrant nightlife, making it a popular tourist destination."
    }
  ],
  "aliases": [
    "LA",
    "City of Angels"
  ],
  "relationships": [
    {
      "type": "located_in",
      "target": "3c4d5e6f-7a8b-9c0d-1e2f-3a4b5c6d7e8f"
    },
    {
      "type": "filming_location_for",
      "target": "850eec9f-5ffd-4637-b3e2-0f9f98a5a72d"
    },
    {
      "type": "filming_location_for",
      "target": "e0c661c3-9b71-4ef4-9ee7-cd23343f5b88"
    },
    {
      "type": "filming_location_for",
      "target": "9b8c7d6e-5f2a-4f23-a820-c0f1fce13248"
    }
  ],
  "properties": {
    "fictional": false,
    "type": "city",
    "state": "California",
    "country": "United States",
    "coordinates": {
      "latitude": 34.0522,
      "longitude": -118.2437
    }
  },
  "facets": {
    "location-type": "city",
    "reality": "real",
    "scale": "city"
  },
  "tags": [
    "active",
    "public",
    "tours-available",
    "entertainment-capital",
    "hollywood",
    "film-industry",
    "southern-california",
    "major-city"
  ]
}