{
  "id": "d3f76394-c89f-4842-8d8a-f5ae42e74e10",
  "type": "location",
  "name": "Lothlórien",
  "description": "An enchanted forest realm ruled by the Elven Lady Galadriel and Lord Celeborn, known for its timeless beauty and magical protection.",
  "content": [
    {
      "title": "Overview",
      "body": "Lothlórien is a sheltered Elven forest kingdom situated east of the Misty Mountains along the River Anduin. It is famed for its ethereal atmosphere, where time seems to flow more slowly due to ancient magic. Governed by Galadriel and Celeborn, it remains a bastion of Elven culture, craftsmanship, and preservation in Middle-earth."
    },
    {
      "title": "Appearance",
      "body": "The forest of Lothlórien is characterized by tall, golden-leaved mallorn trees that tower above a carpet of silver and green. Structures are built with natural materials blending seamlessly into the surroundings, such as the elegant elven platforms and homes high in the trees. Soft silver light pervades the realm, creating an impression of perpetual twilight and enchantment."
    },
    {
      "title": "History",
      "body": "Founded during the Second Age, Lothlórien sustained hardships through invasions and wars but remained a center of Elven refuge and power. It was preserved by the influence of the Elven Rings of Power and its rulers’ wisdom, playing a vital role in the defense of the free peoples against Sauron’s rising darkness in the Third Age."
    },
    {
      "title": "Story Significance",
      "body": "Lothlórien provides critical sanctuary for the Fellowship after the traumatic journey through Moria. The elves’ gifts here prove vital for the quest, and the realm’s timelessness offers hope and healing. It embodies the enduring strength and faded glory of the Elves in Middle-earth’s twilight era."
    }
  ],
  "aliases": [
    "Lórien",
    "The Golden Wood",
    "The Dreaming Wood"
  ],
  "relationships": [
    {
      "type": "located_in",
      "target": "dbd93414-7d92-4a6c-9370-7a316e89d9ae"
    }
  ],
  "properties": {
    "type": "Elven forest kingdom",
    "rulers": "Lady Galadriel and Lord Celeborn",
    "flora": "Mallorn trees",
    "magic": "Preservation and temporal distortion due to Elven Rings"
  },
  "facets": {
    "location-type": "realm",
    "reality": "fictional",
    "scale": "region"
  },
  "tags": [
    "elven",
    "enchanted-forest",
    "sanctuary",
    "middle-earth",
    "magical-protection",
    "timelessness",
    "second-age",
    "elven-rings",
    "twilight-era"
  ]
}