{
  "id": "bffa1c16-ee57-490e-8704-bf801c3b7f33",
  "type": "person",
  "name": "Marion Cotillard",
  "description": "French actress known for her versatile roles and critically acclaimed performances.",
  "content": [
    {
      "title": "Biography",
      "body": "Marion Cotillard was born on September 30, 1975, in Paris, France. She grew up in an artistic household, which fostered her interest in the performing arts from a young age. Cotillard began her acting career in the mid-1990s with minor roles in French television and film, gaining recognition for her talent and versatility."
    },
    {
      "title": "Career",
      "body": "Marion Cotillard achieved international acclaim with her role as Édith Piaf in the 2007 film *La Vie en Rose*, for which she won the Academy Award for Best Actress. Known for her transformative performances, Cotillard has starred in a variety of genres, from blockbuster films like *Inception* to intense dramas like *Rust and Bone*. Her approach is described as deeply immersive, often involving significant research and method acting techniques."
    },
    {
      "title": "Notable Collaborations",
      "body": "Marion Cotillard has frequently collaborated with esteemed director Christopher Nolan, appearing in films such as *Inception* and *The Dark Knight Rises*. Her other notable collaborations include working with directors like Tim Burton and the Dardenne brothers."
    },
    {
      "title": "Legacy",
      "body": "Cotillard's impact on the film industry is marked by her ability to cross over from French cinema to Hollywood while maintaining critical acclaim in both arenas. She has received numerous awards, including a BAFTA, a Golden Globe, and multiple César Awards. Her portrayal of Édith Piaf remains one of the most celebrated performances in modern cinema."
    }
  ],
  "aliases": [
    "Marion Cotillard"
  ],
  "relationships": [
    {
      "type": "starred_in",
      "target": "2b6f3c50-41cf-4bd4-b5a4-981fbf250bdf"
    },
    {
      "type": "starred_in",
      "target": "bc20c469-e768-4609-8f86-70267ae45c1a"
    },
    {
      "type": "worked_with",
      "target": "2c9081c5-6afb-4f06-9a6a-9876543210aa"
    },
    {
      "type": "portrays",
      "target": "fb09e323-a504-42ea-a945-54c080f6437a"
    }
  ],
  "properties": {
    "born": "1975",
    "nationality": "French",
    "occupation": [
      "actor"
    ],
    "active_years": "1993-present"
  },
  "facets": {
    "profession": [
      "actor"
    ],
    "active-era": "2000s",
    "nationality": "french"
  },
  "tags": [
    "drama",
    "thriller",
    "versatile",
    "method-acting",
    "award-winning",
    "french-cinema",
    "hollywood",
    "transformative-performances"
  ]
}