{
  "id": "8e1f45e8-42ac-4c0b-977f-50f479d573b3",
  "type": "person",
  "name": "Michael Caine",
  "description": "Renowned English actor known for his distinctive voice and versatile roles in film.",
  "content": [
    {
      "title": "Biography",
      "body": "Sir Michael Caine, born Maurice Joseph Micklewhite Jr. on March 14, 1933, in Rotherhithe, London, England, is a celebrated English actor. He began his career in repertory theatre and made his breakthrough in the film industry in the 1960s. His distinctive Cockney accent, versatile acting skills, and charming persona have made him a beloved figure in cinema."
    },
    {
      "title": "Career",
      "body": "Michael Caine has appeared in dozens of films throughout his career, including notable works such as *Alfie* (1966), *The Italian Job* (1969), *Get Carter* (1971), and *The Dark Knight Trilogy*. He has been nominated for multiple Academy Awards, winning two for Best Supporting Actor for his performances in *Hannah and Her Sisters* (1986) and *The Cider House Rules* (1999). Caine is known for his ability to portray a wide range of characters, from tough and gritty to charming and sophisticated."
    },
    {
      "title": "Notable Collaborations",
      "body": "Caine has frequently collaborated with director Christopher Nolan, appearing in films such as *Batman Begins*, *The Dark Knight*, *The Dark Knight Rises*, and *Inception*. His onscreen chemistry with actors like Morgan Freeman and Christian Bale has also been widely recognized."
    },
    {
      "title": "Legacy",
      "body": "Michael Caine's contributions to the film industry are immense, with a career spanning over six decades. He has received numerous awards and honors, including a BAFTA Fellowship and a knighthood from Queen Elizabeth II in 2000 for his services to drama. His impact on cinema continues to inspire actors and filmmakers around the world."
    }
  ],
  "aliases": [
    "Maurice Micklewhite"
  ],
  "relationships": [
    {
      "type": "acted_in",
      "target": "fc1e827c-35d3-4aca-aae2-b7be4817a0bf"
    },
    {
      "type": "acted_in",
      "target": "ef425b4c-550c-44bd-8b95-9c2f812b5ac2"
    },
    {
      "type": "acted_in",
      "target": "e8a1d111-ec4d-458b-b5c8-05e022a2d8bb"
    },
    {
      "type": "worked_with",
      "target": "2c9081c5-6afb-4f06-9a6a-9876543210aa"
    },
    {
      "type": "worked_with",
      "target": "e689d7d2-51c0-4fe1-a9b8-2334e19b0d1e"
    },
    {
      "type": "worked_with",
      "target": "4cf6d8b9-71f4-4eff-9c9e-bb3b3f7b2e8e"
    }
  ],
  "properties": {
    "born": 1933,
    "nationality": "British",
    "occupation": [
      "actor",
      "producer",
      "author"
    ],
    "active_years": "1953-present"
  },
  "tags": [
    "actor",
    "drama",
    "thriller",
    "comedy",
    "classic-hollywood",
    "modern"
  ]
}