{
  "id": "dbd93414-7d92-4a6c-9370-7a316e89d9ae",
  "type": "location",
  "name": "Middle-earth",
  "description": "A fictional universe created by J.R.R. Tolkien, encompassing a richly detailed world inhabited by diverse races and cultures.",
  "content": [
    {
      "title": "Overview",
      "body": "Middle-earth is a complex and expansive fictional setting developed by J.R.R. Tolkien as the backdrop for many of his stories. It consists of a vast continent with various realms and cultures, including Elves, Dwarves, Hobbits, Men, Orcs, and many other beings. The world features detailed histories, languages, and mythologies, making it one of the most intricate fantasy universes ever created."
    },
    {
      "title": "Geography and Inhabitants",
      "body": "The geography of Middle-earth includes diverse landscapes ranging from the peaceful Shire to the dark lands of Mordor. Major regions include Rohan, Gondor, the Misty Mountains, and Lothlórien. The inhabitants vary from noble Elves and brave Men to sinister Orcs and dark creatures, each with rich cultural backgrounds, beliefs, and histories that Tolkien meticulously developed."
    },
    {
      "title": "Narrative Significance",
      "body": "Middle-earth serves as the setting for Tolkien's major works, including The Hobbit and The Lord of the Rings trilogy. It provides a mythic backdrop that explores themes of heroism, corruption, friendship, and the struggle between good and evil. The depth of world-building allows readers to immerse themselves fully in the saga of its peoples and the epic quests undertaken."
    },
    {
      "title": "Cultural and Literary Impact",
      "body": "Middle-earth has profoundly influenced modern fantasy literature and popular culture. Through its vivid world-building and detailed languages, it set a standard that many successors have aspired to emulate. The universe has been expanded upon through various texts, adaptations, and fan works, solidifying its place as a cornerstone of fantasy fiction."
    },
    {
      "title": "Origins and Development",
      "body": "The conception of Middle-earth began with Tolkien’s interest in linguistics and mythology, evolving over decades of writing and revising. Initially created as a setting for invented languages, it transformed into a detailed narrative world. Tolkien’s scholarly background and creative impulses shaped Middle-earth into a layered mythos blending history, legend, and fantasy."
    }
  ],
  "aliases": [
    "The World of Middle-earth",
    "Tolkien's Middle-earth",
    "Arda (broader world encompassing Middle-earth)"
  ],
  "relationships": [
    {
      "type": "contains",
      "target": "47b9c418-2f0e-4a4a-9ac3-02f7c0c59ddb"
    },
    {
      "type": "contains",
      "target": "8e688776-ff78-4c90-bbdb-d0298e548c73"
    },
    {
      "type": "contains",
      "target": "c4f64f8e-1fb8-4a39-85d7-397b3ee9ef4c"
    },
    {
      "type": "contains",
      "target": "d3f76394-c89f-4842-8d8a-f5ae42e74e10"
    },
    {
      "type": "contains",
      "target": "fa0913cf-7aa6-4b44-8ec0-5d6b9b3bba4e"
    },
    {
      "type": "created_by",
      "target": "6c3edb3b-1c68-4f0f-9ed9-952d3e7acb6e"
    },
    {
      "type": "featured_in",
      "target": "3f2a8ac1-8265-4be2-b147-af56f003de51"
    }
  ],
  "properties": {
    "region": "Arda",
    "inhabitants": "Elves, Men, Dwarves, Hobbits, Orcs, and others",
    "creator": "J.R.R. Tolkien"
  },
  "facets": {
    "location-type": "continent",
    "reality": "fictional",
    "scale": "region"
  },
  "tags": [
    "world-building",
    "literature",
    "mythology",
    "high-fantasy",
    "j-r-r-tolkien",
    "fictional-universe",
    "legendarium",
    "epic-fantasy"
  ],
  "links": [
    {
      "url": "https://lotr.fandom.com/wiki/Middle-earth",
      "title": "Middle-earth - Tolkien Gateway",
      "type": "fan-wiki"
    },
    {
      "url": "https://en.wikipedia.org/wiki/Middle-earth",
      "title": "Middle-earth - Wikipedia",
      "type": "wiki"
    }
  ]
}