{
  "id": "7b3b796d-02f6-4e16-a55a-4b5f0b9db1e2",
  "type": "character",
  "name": "Miss Moneypenny",
  "description": "The loyal and witty secretary to M in the James Bond series, known for her professional efficiency and subtle romantic tension with James Bond.",
  "content": [
    {
      "title": "Background",
      "body": "**Miss Moneypenny** first appeared in the James Bond franchise as the confidential secretary to M, the head of MI6. While her full origin and early life are not extensively detailed within the canon, she is established as a highly competent and long-serving member of the British intelligence agency. She acts as a key administrative figure within MI6, supporting the agents, most notably James Bond, with sensitive information and logistical assistance."
    },
    {
      "title": "Personality",
      "body": "Miss Moneypenny is characterized by:\n\n- **Loyalty and professionalism:** She is highly dedicated to her duties and to MI6.\n- **Wit and charm:** Often delivers playful banter and subtle flirtation, especially in interactions with James Bond.\n- **Discretion and intelligence:** Handles confidential information with care and provides crucial support without overshadowing field agents.\n- **Romantic inclination:** A notable unspoken affection and playful rapport with James Bond, marked by mutual respect and occasional hints of deeper feelings."
    },
    {
      "title": "Story Role",
      "body": "In the James Bond narrative, Miss Moneypenny serves as a supporting character who:\n\n- Acts as the liaison between M and the agents, especially James Bond.\n- Provides key information, mission briefings, and communications.\n- Serves as a stable and familiar presence in the often dangerous and chaotic spy environment.\n- Adds a humanizing and lighthearted dimension, offering moments of levity and subtle romantic tension.\n\nHer character does not typically undergo major arcs but is integral in creating continuity, depth, and a recurring emotional anchor within the series."
    },
    {
      "title": "Relationships",
      "body": "- **James Bond:** Has a long-standing professional and subtly flirtatious relationship with Bond, filled with mutual respect and underlying affection, though rarely explicitly acted upon.\n- **M:** Loyal and respectful secretary to M, assisting in managing MI6 operations.\n- **MI6 Staff:** Works closely with other intelligence operatives and supports the smooth functioning of the agency."
    },
    {
      "title": "Abilities",
      "body": "- Expert administrative and organizational skills.\n- Proficient in handling secure and sensitive intelligence data.\n- Excellent communication and interpersonal skills.\n- Skilled at maintaining secrecy and discretion under pressure."
    }
  ],
  "aliases": [
    "Moneypenny",
    "Miss Moneypenny Moneypenny"
  ],
  "properties": {
    "species": "human",
    "occupation": "Secretary to M (MI6)",
    "portrayed_by": [
      "Lois Maxwell",
      "Caroline Bliss",
      "Samantha Bond",
      "Naomie Harris"
    ]
  },
  "tags": [
    "supporting",
    "mentor",
    "secretary",
    "MI6",
    "human"
  ]
}