{
  "id": "1ead34fc-bb9c-4f31-9f82-22b5629aeada",
  "type": "person",
  "name": "Nino Rota",
  "description": "Nino Rota was an Italian composer renowned for his prolific film scores, including the iconic music for 'The Godfather' trilogy.",
  "content": [
    {
      "title": "Biography",
      "body": "Giovanni Rota Rinaldi, known as Nino Rota, was born on December 3, 1911, in Milan, Italy. A child prodigy, he composed his first piano piece at the age of eight and studied at prestigious conservatories. His work spans classical music and film scores, making him one of the most influential composers in Italian and international cinema. He passed away in 1979."
    },
    {
      "title": "Career",
      "body": "Rota had an extensive career scoring over 150 films, collaborating with directors like Federico Fellini and Francis Ford Coppola. His music is known for its lyrical melodies, dramatic intensity, and memorable themes. Notably, he composed the music for 'The Godfather' (1972), earning an Academy Award for the sequel's score. His music brings emotional depth and cultural authenticity to the films."
    },
    {
      "title": "Notable Works",
      "body": "Beyond 'The Godfather' series, Rota composed for 'La Strada,' '8½,' and 'Romeo and Juliet' (1968). His 'Godfather Waltz' theme is iconic, instantly associable with the film's atmosphere of family honor and tragedy. Rota’s work enhanced the storytelling with its haunting melodies and period-authentic music sensibility."
    },
    {
      "title": "Style and Influence",
      "body": "Rota's style merged classical tradition with cinematic needs, blending romanticism and modernism. His themes often incorporate folk elements, reflecting Italian heritage, and are known for melody-driven compositions that evoke strong emotional responses. Rota influenced generations of film composers by bridging orchestral music and film narrative effectively."
    }
  ],
  "aliases": [
    "Nino Rota",
    "Giovanni Rota Rinaldi",
    "Film Composer",
    "The Godfather Composer"
  ],
  "relationships": [
    {
      "type": "composed_for",
      "target": "a34e10f7-2f77-48bd-803f-efa34f19c87f"
    }
  ],
  "properties": {
    "birth_date": "1911-12-03",
    "death_date": "1979-04-10",
    "nationality": "Italian",
    "occupation": [
      "Composer",
      "Conductor"
    ],
    "active_years": "1930-1979"
  },
  "facets": {
    "profession": [
      "composer"
    ],
    "active-era": "mid-century",
    "nationality": "italian"
  },
  "tags": [
    "film-score",
    "italian-music",
    "the-godfather",
    "academy-award-winner",
    "classical-music",
    "cinema-music",
    "conductor",
    "orchestral",
    "film-composer"
  ],
  "links": [
    {
      "url": "https://en.wikipedia.org/wiki/Nino_Rota",
      "title": "Nino Rota - Wikipedia",
      "type": "wiki"
    }
  ]
}