{
  "id": "87f73de7-8f05-4c8b-8f8a-a4cfe7115273",
  "type": "location",
  "name": "Paris (Monte Cristo)",
  "description": "The city of Paris as portrayed in the universe of The Count of Monte Cristo.",
  "content": [
    {
      "title": "History",
      "body": "Paris (Monte Cristo) is portrayed as a grand and influential city in 19th-century France within the story of *The Count of Monte Cristo*. It serves as the political and social backdrop where the protagonist, Edmond Dantès, moves after his transformation into the Count. Key historical moments in the narrative include the court trial that falsely convicts Dantès, social intrigues among the aristocracy, and sites of ultimate revenge and redemption.\n\nThe city's history in the novel reflects the post-Napoleonic era, marked by political tension and shifting power dynamics among nobility."
    },
    {
      "title": "Geography",
      "body": "The fictional version of Paris within the *Monte Cristo* universe is modeled after the real city but is distinctly the setting of the 19th century. It includes affluent neighborhoods, grand boulevards, and close proximity to other key locations such as the Château d'If and Marseille (Monte Cristo).\n\nThe city is known for its elegant architecture, sizable population, and prominence as a center of power and culture."
    },
    {
      "title": "Notable Features",
      "body": "**Landmarks and locations mentioned or implied in the narrative:**\n\n- The Palais de Justice, where trials occur, including that of Edmond Dantès.\n- Luxurious mansions and estates belonging to noble families like the de Villeforts and Danglars.\n- The social venues such as theaters and salons where high society gathers.\n\nThough the real city of Paris has many landmarks, the Monte Cristo narrative emphasizes these social and judicial sites as critical to the plot."
    },
    {
      "title": "Story Significance",
      "body": "Paris (Monte Cristo) is the central stage for much of Edmond Dantès's transformation and quest for revenge. It is here that:\n\n- Dantès reinvents himself as the Count of Monte Cristo.\n- He confronts and manipulates those who plotted against him.\n- The climax of his plans unfold within the salons, courtrooms, and city streets.\n\nThe city's society and politics drive the narrative's tension and resolution, making Paris essential to the story's progression."
    }
  ],
  "aliases": [
    "Paris",
    "Paris, France (The Count of Monte Cristo)"
  ],
  "properties": {
    "fictional": true,
    "type": "city",
    "founded": "Ancient (exact year unknown)",
    "population": "Large (est. hundreds of thousands in the 19th century)"
  },
  "relationships": [
    {
      "type": "featured_in",
      "target": "3c6350b1-f92d-4f6a-a7e7-e82f61c57b13"
    },
    {
      "type": "located_in",
      "target": "d29c3776-bfec-4fde-a6de-a191d5a60f9d"
    },
    {
      "type": "contains",
      "target": "25c7e3f9-896d-4b1c-9f8b-5f67ae3d1825"
    },
    {
      "type": "contains",
      "target": "919f9f8b-0d8b-4abc-8e2d-f9c0b8980710"
    }
  ],
  "tags": [
    "city",
    "historical",
    "classic literature",
    "19th century",
    "fictional",
    "drama"
  ]
}