{
  "id": "1a2b3c4d-5e6f-7a8b-9c0d-1e2f3a4b5c6d",
  "type": "location",
  "name": "Pasadena",
  "description": "A city in Los Angeles County, California, known for the Rose Bowl, Caltech, and as a popular filming location for movies and television.",
  "content": [
    {
      "title": "Overview",
      "body": "Pasadena is a city located in Los Angeles County, California, situated at the base of the San Gabriel Mountains. With a population of approximately 140,000, it is known for its historic architecture, cultural institutions, and annual Tournament of Roses Parade and Rose Bowl Game held on New Year's Day."
    },
    {
      "title": "Notable Landmarks",
      "body": "The city is home to several notable institutions including the California Institute of Technology (Caltech), NASA's Jet Propulsion Laboratory, the Norton Simon Museum, and the Pasadena Playhouse. The Rose Bowl Stadium, one of America's most famous sports venues, hosts college football games and has been the site of multiple Super Bowls and FIFA World Cup matches."
    },
    {
      "title": "Film and Television",
      "body": "Pasadena has served as a filming location for numerous productions due to its well-preserved historic neighborhoods and distinctive architecture. The Gamble House, a masterpiece of American Arts and Crafts architecture, was featured prominently in the Back to the Future trilogy as Doc Brown's residence."
    }
  ],
  "aliases": [
    "Pasadena, California",
    "Pasadena, CA"
  ],
  "relationships": [
    {
      "type": "located_in",
      "target": "2b3c4d5e-6f7a-8b9c-0d1e-2f3a4b5c6d7e"
    },
    {
      "type": "featured_in",
      "target": "e0c661c3-9b71-4ef4-9ee7-cd23343f5b88"
    },
    {
      "type": "contains",
      "target": "b3734d99-c7f4-480f-b3b3-638842efe417"
    },
    {
      "type": "contains",
      "target": "163f25f5-8a97-40f9-bb36-d9edb5cb43cf"
    },
    {
      "type": "contains",
      "target": "aad70d92-5fbb-4c71-b553-22a01ed58db5"
    }
  ],
  "properties": {
    "type": "city",
    "state": "California",
    "country": "United States",
    "fictional": false
  },
  "facets": {
    "location-type": "city",
    "reality": "real",
    "scale": "city"
  },
  "tags": [
    "california",
    "filming-location",
    "los-angeles-county",
    "rose-bowl",
    "caltech",
    "southern-california",
    "urban",
    "tourist-destination"
  ]
}