{
  "id": "c4f64f8e-1fb8-4a39-85d7-397b3ee9ef4c",
  "type": "location",
  "name": "Rivendell",
  "description": "A hidden Elven refuge nestled in a peaceful valley, Rivendell serves as a sanctuary and meeting place in Middle-earth.",
  "content": [
    {
      "title": "Overview",
      "body": "Rivendell, also known as Imladris, is an Elven haven located in a secluded valley of the Misty Mountains. Founded and ruled by Elrond, it is a place of rest, healing, and wisdom, where many travelers seek refuge and counsel. Its isolation and natural beauty are enhanced by the protection of Elvish magic, preserving the valley as a sanctuary against the dangers of the world outside."
    },
    {
      "title": "Appearance",
      "body": "The valley of Rivendell is lush and verdant, surrounded by encircling mountains and abundant woodland. The architecture features elegant Elven designs: slender arches, flowing lines, and exquisite carvings integrated seamlessly into the natural landscape. Buildings blend harmoniously with waterfalls, gardens, and ancient trees, reflecting the Elves’ deep connection to nature and their craftsmanship."
    },
    {
      "title": "History",
      "body": "Rivendell was established by Elrond during the Second Age after the fall of Eregion and the forging of the Rings of Power. It played a key role throughout Middle-earth’s history as a bastion of Elven knowledge and power. During the Third Age, it served as the site for important councils and a refuge for heroes, most notably hosting the Council of Elrond where the fate of the One Ring was debated."
    },
    {
      "title": "Story Significance",
      "body": "Rivendell is central in ‘The Lord of the Rings’ as the place where the Fellowship of the Ring is formed to undertake the perilous quest to destroy the One Ring. It symbolizes hope, unity, and ancient wisdom. As a sanctuary, it offers respite and counsel to the characters, playing a pivotal role in the alliance-building that fuels the resistance against Sauron."
    }
  ],
  "aliases": [
    "Imladris",
    "The Last Homely House East of the Sea",
    "Elrond's Refuge"
  ],
  "relationships": [
    {
      "type": "located_in",
      "target": "f1b2c3d4-e5f6-7890-abcdefghijk1"
    }
  ],
  "properties": {
    "region": "Misty Mountains",
    "ruler": "Elrond",
    "inhabitants": "Elves and allies",
    "age": "Established in the Second Age"
  },
  "tags": [
    "Elven",
    "sanctuary",
    "Middle-earth",
    "valley",
    "Misty Mountains",
    "refuge",
    "hidden",
    "ancient"
  ]
}