{
  "id": "dbf564e7-1a57-4ed3-a2b0-ec5d646bdb24",
  "type": "person",
  "name": "Robert Pattinson",
  "description": "English actor known for his roles in Twilight and The Batman films.",
  "content": [
    {
      "title": "Biography",
      "body": "Robert Douglas Thomas Pattinson was born on May 13, 1986, in London, England. He began his acting career at a young age, initially performing in amateur plays with the Barnes Theatre Company before landing his first major role in the Harry Potter series as Cedric Diggory. Pattinson rose to international fame with his portrayal of Edward Cullen in the 'Twilight' film series."
    },
    {
      "title": "Career",
      "body": "Pattinson's career took off with the 'Twilight' saga, which became a global phenomenon. He diversified his roles post-Twilight, appearing in independent films like 'Cosmopolis', 'The Lighthouse', and 'Good Time'. His role as Batman in Matt Reeves' 'The Batman' reinvigorated his career in mainstream Hollywood. Pattinson is known for his versatility and willingness to take on complex, non-commercial roles."
    },
    {
      "title": "Notable Collaborations",
      "body": "Robert Pattinson has worked with acclaimed directors such as Christopher Nolan in 'Tenet', Claire Denis in 'High Life', and Matt Reeves in 'The Batman'. His collaborations often see him in critical and demanding roles that showcase his range as an actor."
    },
    {
      "title": "Legacy",
      "body": "Pattinson's impact on the film industry is significant, having successfully transitioned from teen heartthrob to a respected actor in both independent and blockbuster films. His performances have earned him critical acclaim, and he is seen as one of the most talented actors of his generation. Pattinson has been nominated for several awards, including the BAFTA, and remains a prominent figure in cinema."
    }
  ],
  "aliases": [
    "R-Patz"
  ],
  "relationships": [
    {
      "type": "acted_in",
      "target": "e8a1d111-ec4d-458b-b5c8-05e022a2d8bb"
    },
    {
      "type": "acted_in",
      "target": "2c9081c5-6afb-4f06-9a6a-9876543210aa"
    },
    {
      "type": "worked_with",
      "target": "709fafc7-7df4-4a2e-8b8a-e53e9da184f7"
    },
    {
      "type": "worked_with",
      "target": "c5a2f886-e97f-4c2b-b103-a1f99c5e876d"
    }
  ],
  "properties": {
    "born": 1986,
    "nationality": "British",
    "occupation": [
      "actor",
      "musician"
    ],
    "active_years": "2004-present"
  },
  "tags": [
    "actor",
    "drama",
    "thriller",
    "modern"
  ]
}