{
  "id": "3b9a4e9d-8605-4a10-8a28-f3c0efb68399",
  "type": "person",
  "name": "Robert De Niro",
  "description": "American actor and producer acclaimed for his transformative roles, including his portrayal of young Vito Corleone in The Godfather Part II.",
  "content": [
    {
      "title": "Biography",
      "body": "Born on August 17, 1943, in New York City, Robert De Niro is a renowned American actor and producer, known for his intense preparation for roles and collaboration with director Martin Scorsese. His career spans over five decades, during which he earned critical acclaim and multiple Academy Awards, establishing him as one of the greatest actors in cinematic history."
    },
    {
      "title": "Career",
      "body": "De Niro's career breakthrough came in the 1970s with films like Mean Streets and Taxi Driver. Notably, his transformative role as young Vito Corleone in The Godfather Part II (1974) earned him the Academy Award for Best Supporting Actor. Beyond The Godfather series, he is known for work in Raging Bull, Goodfellas, and Casino. De Niro is recognized for his method acting approach and versatility across crime dramas, comedies, and thrillers."
    },
    {
      "title": "Notable Works",
      "body": "Some of De Niro's most notable films include The Godfather Part II, Raging Bull, for which he won Best Actor Oscar, Goodfellas, Casino, Taxi Driver, and The Deer Hunter. His portrayal of complex characters often involves deep psychological exploration, setting a standard for realistic acting."
    },
    {
      "title": "Style and Influence",
      "body": "De Niro is synonymous with method acting, immersing himself fully in his characters, sometimes physically transforming for roles. His meticulous preparation and collaborations with auteurs like Scorsese and Coppola have influenced generations of actors. His role as young Vito Corleone provided a captivating origin story that added depth to the iconic saga."
    }
  ],
  "aliases": [
    "Bob De Niro",
    "Robert Anthony De Niro Jr.",
    "The Godfather Part II Vito Corleone Actor"
  ],
  "relationships": [
    {
      "type": "starred_in",
      "target": "a34e10f7-2f77-48bd-803f-efa34f19c87f"
    },
    {
      "type": "collaborated_with",
      "target": "c857a03d-7ebb-4c40-b28c-b2300a053505"
    }
  ],
  "properties": {
    "birthdate": "1943-08-17",
    "nationality": "American",
    "occupation": "Actor, Producer",
    "award": "Academy Award for Best Supporting Actor (1975)"
  },
  "tags": [
    "actor",
    "The Godfather Part II",
    "Academy Award Winner",
    "method acting",
    "film",
    "cinema",
    "biographical"
  ]
}