{
  "id": "28965f47-92a8-4dee-8ca2-d0c21d06fcd8",
  "type": "location",
  "name": "Salt Lake City (Study in Scarlet)",
  "description": "Salt Lake City as depicted in 'A Study in Scarlet', serving as a pivotal setting linked to the narrative's Western frontier elements.",
  "content": [
    {
      "title": "Overview",
      "body": "Salt Lake City is featured prominently in the narrative of 'A Study in Scarlet', serving as a critical geographical and cultural backdrop in the story’s second half. This location represents the American frontier, reflecting the Mormon settlement and pioneer spirit that interfaced significantly with the plot’s themes of justice and law. It embodies the ruggedness and expansive territories of the American West during the mid to late 19th century."
    },
    {
      "title": "Appearance",
      "body": "In 'A Study in Scarlet', Salt Lake City is portrayed with its distinctive architecture and surrounding landscape typical of a western settlement. The city includes a sparse urban arrangement with Mormon temple settings and frontier-style buildings, set against the broader mountainous and arid terrain. This creates a vividly atmospheric scene contrasting with London’s urbanity."
    },
    {
      "title": "History",
      "body": "Historically, Salt Lake City was a center for Mormon settlers who established the city as a religious and community sanctuary. In the context of the novel, the settlement is intricately connected to the background of the antagonist's motivations and the story’s complex backstory, illustrating the societal tensions, religious zealotry, and frontier justice that influence character decisions."
    },
    {
      "title": "Story Significance",
      "body": "Salt Lake City is crucial in 'A Study in Scarlet' as it serves as the location where the mystery’s underlying motives, including a revenge narrative rooted in the early days of Mormon settlement, unfold. This segment enriches the novel by providing context to the crime, complementing the London detective work and highlighting Sherlock Holmes's deductive prowess against a dramatic historical backdrop."
    }
  ],
  "aliases": [
    "Salt Lake City",
    "Mormon Salt Lake",
    "Western Setting (Study in Scarlet)"
  ],
  "relationships": [],
  "properties": {
    "country": "United States",
    "region": "Utah",
    "historical_period": "Mid 19th Century",
    "genre_association": "Mystery, Western"
  },
  "facets": {
    "location-type": "city",
    "reality": "real",
    "scale": "city"
  },
  "tags": [
    "a-study-in-scarlet",
    "mormonism",
    "western-frontier",
    "sherlock-holmes",
    "american-west",
    "mormon-temple",
    "frontier-justice",
    "historical-setting",
    "utah",
    "mormon-settlement"
  ]
}