{
  "id": "ef8c90fa-e1e8-4c1a-9707-c626f1b6e7bd",
  "type": "character",
  "name": "Samwise Gamgee",
  "description": "Samwise Gamgee, often known simply as Sam, is a loyal and brave Hobbit who serves as Frodo Baggins's steadfast companion on the quest to destroy the One Ring.",
  "content": [
    {
      "title": "Background",
      "body": "Samwise Gamgee is a Hobbit of the Shire, born as the son of Hamfast Gamgee, the Gaffer. Raised in the peaceful environment of Hobbiton, Sam was a gardener by trade, working for Frodo Baggins before the start of the quest. Despite his humble beginnings, he was chosen to be Frodo's companion and protector during the perilous journey to Mount Doom. His simple origins belie the resilience and courage he displays throughout the story."
    },
    {
      "title": "Personality",
      "body": "Sam is characterized by his unwavering loyalty, courage, and humility. He is deeply faithful to Frodo and possesses a sturdy, optimistic spirit that often counters the darkness and despair surrounding their mission. Despite occasional fears and doubts, Sam's determination and love for his friends drive him forward. His honesty, kindness, and grounded nature make him a beloved figure among his peers."
    },
    {
      "title": "Story Role",
      "body": "Samwise plays a pivotal role in 'The Fellowship of the Ring' as Frodo's gardener, servant, and protector. He represents the everyman whose ordinary qualities become heroic through loyalty and perseverance. Throughout the journey, Sam's steadfastness supports Frodo physically and emotionally, and he ultimately carries Frodo when the burden of the Ring becomes overwhelming. His actions are instrumental in the success of the Fellowship's mission."
    },
    {
      "title": "Relationships",
      "body": "Sam's greatest relationship is with Frodo Baggins, whom he serves with unshakeable loyalty. He also shares a kind, brotherly friendship with other members of the Fellowship, including Merry and Pippin. Sam’s affection extends to Rosie Cotton, a Hobbit of the Shire, whom he loves deeply and eventually marries. His relationship dynamics reflect his kind-hearted and dependable nature."
    },
    {
      "title": "Abilities and Skills",
      "body": "Sam is an excellent gardener, knowledgeable about herbs and plants, a skill which proves useful during the journey when foraging for food and healing herbs. He is physically strong for a Hobbit, displaying resilience and endurance beyond expectations, especially when carrying Frodo. Sam is also courageous in battle, wielding a small sword called Sting and a cooking pot helmet, and shows surprising tactical sense and resourcefulness in perilous situations."
    }
  ],
  "aliases": [
    "Sam",
    "Sam Gamgee",
    "Samwise",
    "The Gaffer’s son"
  ],
  "relationships": [
    {
      "type": "companion_of",
      "target": "668d4c66-92e8-4b6e-b695-bd9fd6283f22"
    },
    {
      "type": "companion_of",
      "target": "0e4a7328-6d97-40a1-8769-bb8c4f91e64d"
    },
    {
      "type": "companion_of",
      "target": "9a12e591-8131-4a38-b2f1-64e345fe5c50"
    },
    {
      "type": "companion_of",
      "target": "d4c6f2a9-45b3-427e-abd4-5241a7ca92b8"
    }
  ],
  "properties": {
    "species": "Hobbit",
    "home": "The Shire",
    "weapon": "Sting",
    "occupation": "Gardener"
  },
  "facets": {
    "role": "supporting",
    "morality": "heroic",
    "archetype": "everyman"
  },
  "tags": [
    "hobbit",
    "fellowship-of-the-ring",
    "loyal-companion",
    "gardener",
    "middle-earth",
    "stewardship",
    "resilience",
    "hope",
    "courage"
  ],
  "links": [
    {
      "url": "https://lotr.fandom.com/wiki/Samwise_Gamgee",
      "title": "Samwise Gamgee - Tolkien Gateway",
      "type": "fan-wiki"
    },
    {
      "url": "https://en.wikipedia.org/wiki/Samwise_Gamgee",
      "title": "Samwise Gamgee - Wikipedia",
      "type": "wiki"
    }
  ]
}