{
  "id": "0f9facd7-3a76-4eef-bd86-40dbba9f04ef",
  "type": "item",
  "name": "Tesla Machine",
  "description": "A mysterious device invented by Nikola Tesla, capable of duplicating objects, including living beings.",
  "content": [
    {
      "title": "Overview",
      "body": "The Tesla Machine is a pivotal invention in the story of **The Prestige**, designed and built by Nikola Tesla for the magician Robert Angier. The device is capable of creating an exact duplicate of an object or person placed inside it."
    },
    {
      "title": "Appearance",
      "body": "The machine is large and imposing, with a network of wires and coils. It features a central platform where items or people are placed and is surrounded by a cage-like structure to contain its energy."
    },
    {
      "title": "Function",
      "body": "When activated, the Tesla Machine uses a massive electrical charge to duplicate an object or person placed within its field, creating a perfect copy at a safe distance from the original."
    },
    {
      "title": "History",
      "body": "The Tesla Machine was commissioned by Robert Angier, a rival magician seeking to outperform his competitor, Alfred Borden, with a groundbreaking act called *The Real Transported Man*. Nikola Tesla, portrayed by David Bowie, constructed the device at his laboratory in Colorado Springs."
    },
    {
      "title": "Story Significance",
      "body": "The Tesla Machine is central to the plot of **The Prestige** as it allows Robert Angier to perform his most spectacular trick, creating a real duplicate of himself each night of his show. This ultimately leads to a series of tragic events, including Angier's own demise."
    }
  ],
  "aliases": [
    "Duplicating Machine"
  ],
  "relationships": [
    {
      "type": "featured_in",
      "target": "278eef75-2ad5-4241-b689-e4ea9f35ac58"
    },
    {
      "type": "used_by",
      "target": "5f5157b1-7e9e-4df0-9a2f-d5cb0a2fb7e0"
    },
    {
      "type": "created_by",
      "target": "f0a4b9f1-789a-4814-8bcd-369a8d564ea6"
    },
    {
      "type": "located_at",
      "target": "b87f1b7e-6794-4fcb-aaa0-4eedf013e2e3"
    }
  ],
  "properties": {
    "item_type": "device",
    "created_by": "Nikola Tesla",
    "fictional": true
  },
  "facets": {
    "item-type": "device",
    "reality": "fictional"
  },
  "tags": [
    "technology",
    "duplicating",
    "powerful",
    "nikola-tesla",
    "the-prestige",
    "magician",
    "energy-weapon",
    "electrical",
    "science-fiction"
  ],
  "links": [
    {
      "url": "https://en.wikipedia.org/wiki/Nikola_Tesla#Inventions",
      "title": "Nikola Tesla - Inventions - Wikipedia",
      "type": "wiki"
    }
  ]
}