{
  "id": "2baf795a-8815-4b66-91f9-65ffe96574de",
  "type": "item",
  "name": "The Ventilator",
  "description": "A small air vent connecting two rooms, crucial in the murder method in The Adventure of the Speckled Band.",
  "content": [
    {
      "title": "Overview",
      "body": "The Ventilator is a carefully concealed air duct installed in Stoke Moran, the ancestral home in The Adventure of the Speckled Band. Its primary function apparently was to provide ventilation between Dr. Roylott's room and his stepdaughter Julia Stoner’s adjoining bedroom, but in truth it was a critical part of a sinister murder device that allowed a venomous snake to traverse unseen. The ventilator’s design masked its deadly purpose."
    },
    {
      "title": "Appearance",
      "body": "The Ventilator is built as a small, rectangular opening high on the wall, connecting the two bedrooms belonging to Dr. Roylott and Julia Stoner. It is roughly constructed but painted or disguised to fit the old decor, blending seamlessly into the wall and ceiling space to avoid attracting attention. In the story, Holmes notices this unique feature allowing air passage between the rooms, which is pivotal in exposing the crime."
    },
    {
      "title": "Function",
      "body": "While ostensibly meant to aid air circulation inside the aging mansion, the Ventilator was purposefully installed to facilitate the passage of Dr. Roylott’s trained swamp adder snake from his locked room into Julia Stoner’s bedroom, and later to threaten Helen Stoner. It allowed the perilous serpent an undetectable route, bypassing normal barriers, and was an essential element for the murder method operating at night."
    },
    {
      "title": "History",
      "body": "Commissioned and installed by Dr. Grimesby Roylott, the ventilator was part of his elaborate scheme to murder his stepdaughters and claim their inheritance. Its presence wasn’t documented officially, and only an observant visitor such as Sherlock Holmes detected its duplicity. The device’s history is tied closely to the dark events at Stoke Moran."
    },
    {
      "title": "Story Significance",
      "body": "The ventilator's discovery is a turning point in The Adventure of the Speckled Band. Sherlock Holmes’s understanding that this duct connected the two adjoining rooms reveals how the fatal snake reached its victims, exposing Dr. Roylott’s cruel plan. The inclusion of the ventilator enhances the mystery’s complexity and serves as a classic example of hidden architectural features enabling sinister deeds."
    }
  ],
  "aliases": [
    "Air Vent",
    "Wall Ventilator",
    "Ventilation Duct",
    "Secret Vent"
  ],
  "relationships": [
    {
      "type": "appears_in",
      "target": "7b9b54fe-410e-44c3-b790-9957c11db367"
    },
    {
      "type": "used_by",
      "target": "3b5a0728-8cee-4d05-bc8f-cf2ff0915de7"
    }
  ],
  "properties": {
    "material": "Wood and plaster",
    "location": "Wall between Dr. Roylott's room and Julia Stoner's bedroom",
    "function": "Ventilation and snake passage",
    "year_installed": "Late 19th century"
  },
  "tags": [
    "The Adventure of the Speckled Band",
    "Sherlock Holmes",
    "Mystery",
    "Hidden Passage",
    "Victorian Era",
    "Murder Method"
  ]
}