{
  "id": "c45406b4-9c8f-4f0d-8f0d-df8562b1e735",
  "type": "character",
  "name": "The Protagonist",
  "description": "The main character in Christopher Nolan's time-bending film, 'Tenet', known for his role in preventing World War III.",
  "content": [
    {
      "title": "Background",
      "body": "The Protagonist is a highly trained operative, originally working as a CIA agent. Following a mission gone wrong where he demonstrates loyalty, he is recruited by the mysterious organization 'Tenet', set up to prevent global catastrophe through the reversal of time."
    },
    {
      "title": "Personality",
      "body": "He is determined, quick-thinking, and adaptable. With a strong moral compass and sense of loyalty, he is willing to risk personal sacrifice for the greater good. The Protagonist often displays a calm demeanor under pressure."
    },
    {
      "title": "Story Role",
      "body": "As the main character in 'Tenet', The Protagonist is integral to the narrative. His arc follows his transformation from a regular agent to a key figure in a time-inverted war. He learns the complexities of the time inversion and fulfills a pivotal role in maintaining peace."
    },
    {
      "title": "Relationships",
      "body": "The Protagonist forms a deep alliance with Neil, a fellow agent from the future, and develops a protective relationship with Kat, whose involvement becomes personal and strategic. He works alongside the enigmatic scientist and arms dealer Priya to understand more about the inverted world."
    },
    {
      "title": "Abilities",
      "body": "Trained in combat and espionage, The Protagonist is adept in hand-to-hand combat and proficient with firearms. He is skilled in strategies involving time inversion, allowing him to navigate and exploit time-bending scenarios to his advantage."
    }
  ],
  "aliases": [],
  "relationships": [
    {
      "type": "appears_in",
      "target": "bc20c469-e768-4609-8f86-70267ae45c1a"
    },
    {
      "type": "portrayed_by",
      "target": "0c1d2eb3-acf4-4343-9924-58f2bf89e121"
    },
    {
      "type": "appears_in",
      "target": "d1e1e9a0-dfb4-4db9-a1b0-3e74f3b41f97"
    }
  ],
  "properties": {
    "species": "human",
    "occupation": "CIA agent, operative for Tenet",
    "portrayed_by": "John David Washington"
  },
  "facets": {
    "role": "protagonist",
    "morality": "heroic",
    "archetype": "warrior"
  },
  "tags": [
    "time-traveler",
    "cia-agent",
    "espionage",
    "hand-to-hand-combat",
    "time-inversion",
    "loyalty",
    "tenet",
    "john-david-washington"
  ]
}