{
  "id": "3c6350b1-f92d-4f6a-a7e7-e82f61c57b13",
  "type": "book",
  "name": "The Count of Monte Cristo",
  "description": "A classic adventure novel by Alexandre Dumas, chronicling the story of Edmond Dantès and his quest for justice and revenge.",
  "content": [
    {
      "title": "Synopsis",
      "body": "The Count of Monte Cristo follows the life of Edmond Dantès, a young and promising sailor who is wrongfully imprisoned due to the jealousies and betrayals of his rivals. After a daring escape from the notorious Château d'If, he discovers a vast treasure on the Isle of Monte Cristo. Using his newfound wealth and identity, he embarks on a carefully orchestrated plan to exact justice and revenge on those who wronged him, while uncovering mysteries and forging new alliances along the way."
    },
    {
      "title": "Themes",
      "body": "Major themes explored in the novel include justice and vengeance, the corrupting influence of power and wealth, forgiveness and redemption, betrayal and loyalty, and the complexities of fate and free will. The story also delves into the transformation of identity and the moral ambiguities involved in revenge."
    },
    {
      "title": "Publication History",
      "body": "Originally published in serial form between 1844 and 1846 in the French newspaper Journal des Débats, The Count of Monte Cristo was later released as a complete novel. It has since been published in numerous editions worldwide and translated into many languages, establishing itself as one of the most popular and enduring works of 19th-century literature."
    },
    {
      "title": "Legacy",
      "body": "The Count of Monte Cristo is widely regarded as a masterpiece of adventure literature and has had a profound influence on the genre of revenge and adventure stories. Its themes and narrative structure have inspired countless adaptations, including films, television series, stage plays, and comics. The novel remains a cultural touchstone for tales of redemption and justice, and its central character, the Count, has become an iconic figure in literary history."
    }
  ],
  "aliases": [
    "Le Comte de Monte-Cristo",
    "Monte Cristo",
    "The Count"
  ],
  "relationships": [
    {
      "type": "written_by",
      "target": "f1af5aff-89e5-443b-9440-fc66997977ab"
    },
    {
      "type": "features_character",
      "target": "5b178eaf-65ec-4c0d-8f34-93fab1c9b5f6"
    },
    {
      "type": "features_character",
      "target": "4d2f65d9-5158-4563-8055-8eef6c6f9786"
    },
    {
      "type": "features_character",
      "target": "b8d6f445-34f2-4a94-b9e6-608d667b7727"
    },
    {
      "type": "features_character",
      "target": "4fbe1a5d-6f87-44c1-9e0c-d5f49f4f752d"
    },
    {
      "type": "features_character",
      "target": "761d9e94-6294-472b-a35c-bbf470a6d510"
    },
    {
      "type": "features_character",
      "target": "878e8ef7-cac7-4094-8b84-a5467a5248ed"
    },
    {
      "type": "features_location",
      "target": "25c7e3f9-896d-4b1c-9f8b-5f67ae3d1825"
    },
    {
      "type": "features_location",
      "target": "a1d9f0c7-758c-4b8d-a6f7-e2b12858e1c2"
    },
    {
      "type": "features_location",
      "target": "919f9f8b-0d8b-4abc-8e2d-f9c0b8980710"
    }
  ],
  "properties": {
    "publication_year": 1844,
    "genre": [
      "Adventure",
      "Historical Fiction",
      "Drama",
      "Romance"
    ],
    "page_count": 1276,
    "original_language": "French"
  },
  "facets": {
    "genre": [
      "adventure",
      "drama",
      "romance"
    ],
    "era": "19th century",
    "tone": [
      "serious",
      "dramatic"
    ],
    "rating": "family"
  },
  "tags": [
    "classic",
    "justice",
    "revenge",
    "redemption",
    "betrayal",
    "identity",
    "loyalty",
    "fate",
    "forgiveness"
  ]
}