{
  "id": "d1d75703-547e-4912-b4b9-c0f9312d7483",
  "type": "item",
  "name": "Walther PPK",
  "description": "A compact semi-automatic pistol famously used by James Bond as his signature sidearm.",
  "content": [
    {
      "title": "Overview",
      "body": "**Walther PPK** is a compact semi-automatic pistol notable for its concealability and reliability. Created primarily for self-defense and covert operations, it has become an iconic weapon in espionage fiction, particularly as the favored firearm of the British secret agent James Bond."
    },
    {
      "title": "Appearance",
      "body": "The Walther PPK features a sleek, all-metal frame with a short barrel and slide, typically finished in blued steel. It is recognizable by its smooth contours, wooden or synthetic grips, and compact size optimized for concealment. The pistol is small enough to be comfortably carried concealed yet large enough to maintain effective stopping power."
    },
    {
      "title": "Function",
      "body": "The PPK is a double-action/single-action semi-automatic pistol chambered usually in .32 ACP or .380 ACP calibers. It has a fixed barrel and a blowback-operated mechanism, known for its ease of use, reasonable accuracy, and moderate recoil. It holds a magazine capacity of 7 or 8 rounds depending on the caliber. The pistol is designed for quick draw and accurate close-to-medium range shooting."
    },
    {
      "title": "History",
      "body": "Designed in the 1930s by Carl Walther GmbH, the Walther PPK was initially introduced as a compact variant of the Walther PP. It became widely recognized greatly through James Bond novels by Ian Fleming and subsequent films. Bond’s use of the PPK helped cement its place in popular culture as a quintessential spy weapon, symbolizing British sophistication and deadly efficiency."
    },
    {
      "title": "Story Significance",
      "body": "The Walther PPK is James Bond's trademark sidearm throughout many of his missions. It is featured in numerous iconic scenes, such as:\n\n- Bond using it to evade capture or silence enemies with precision.\n- The pistol's concealability frequently saving Bond in tight situations.\n- Its distinctive click and appearance becoming synonymous with the character’s lethal skill and suave demeanor.\n\nThe PPK is not only a tool but a symbol of Bond’s identity as a suave and dangerous spy."
    }
  ],
  "aliases": [
    "PPK",
    "James Bond's Walther PPK",
    "Walther PPK pistol"
  ],
  "relationships": [
    {
      "type": "used_by",
      "target": "4b751a8e-3dce-4f29-8d1a-4e7db45a98fe"
    },
    {
      "type": "featured_in",
      "target": "9b1ab6a0-df91-4c86-8a72-8c23b7428298"
    },
    {
      "type": "created_by",
      "target": "e5d3f69c-ce24-4a97-a133-6a74f0b5f6be"
    }
  ],
  "properties": {
    "item_type": "weapon",
    "caliber": ".32 ACP / .380 ACP",
    "action": "double-action/single-action semi-automatic",
    "capacity": "7-8 rounds",
    "fictional": true,
    "manufacturer": "Carl Walther GmbH",
    "origin": "Germany"
  },
  "tags": [
    "weapon",
    "firearm",
    "pistol",
    "spy gear",
    "James Bond",
    "espionage",
    "classic"
  ]
}