{
  "id": "380e0a6b-1e6d-4f90-8069-0f73e2df8b61",
  "type": "location",
  "name": "Wayne Manor",
  "description": "The ancestral home of the Wayne family and the primary residence of Bruce Wayne.",
  "content": [
    {
      "title": "History",
      "body": "Wayne Manor has been the ancestral home of the Wayne family for generations. It is depicted as a large mansion where Bruce Wayne, alias Batman, grew up and lived. The manor serves not only as a residence but also houses the secret Batcave, operating as the base for Batman. In \"Batman Begins,\" the mansion suffers severe damage during the events orchestrated by Henri Ducard and the League of Shadows but is later rebuilt."
    },
    {
      "title": "Geography",
      "body": "Situated on a secluded estate outside Gotham City, Wayne Manor is set on vast grounds that include lush gardens, a vast forest, and access to underground caves. Its remote location provides privacy for Bruce Wayne and aids in concealing his identity as Batman."
    },
    {
      "title": "Notable Features",
      "body": "- **Main Mansion**: The large, Gothic-style mansion boasts advanced security and technology.\n- **Batcave**: Situated beneath the manor, the Batcave serves as the operational center for Batman, equipped with high-tech equipment and vehicles.\n- **Secret Entrances**: Numerous hidden passages and secret entrances lead to the Batcave, ensuring secrecy."
    },
    {
      "title": "Story Significance",
      "body": "Wayne Manor plays a critical role throughout \"The Dark Knight Trilogy.\" It is the location of significant character development for Bruce Wayne, notably in \"Batman Begins,\" where it is destroyed and later signifies his growth with its reconstruction. The Batcave underneath the manor is where Bruce Wayne and his allies plan their operations and conduct research."
    }
  ],
  "aliases": [
    "Bruce Wayne's Home",
    "Batman's Residence"
  ],
  "relationships": [
    {
      "type": "located_in",
      "target": "d55f7b9e-3b3b-4b8d-a2ef-8b8cbecf3883"
    },
    {
      "type": "contains",
      "target": "94768b45-89e7-4a8f-99a4-4d038b1357be"
    },
    {
      "type": "featured_in",
      "target": "fc1e827c-35d3-4aca-aae2-b7be4817a0bf"
    },
    {
      "type": "featured_in",
      "target": "ef425b4c-550c-44bd-8b95-9c2f812b5ac2"
    },
    {
      "type": "featured_in",
      "target": "e8a1d111-ec4d-458b-b5c8-05e022a2d8bb"
    }
  ],
  "properties": {
    "fictional": true,
    "type": "building"
  },
  "tags": [
    "building",
    "superhero",
    "Gothic",
    "Batman",
    "Bruce Wayne",
    "Gotham City"
  ]
}