{
  "id": "2d0a0ec6-6fdb-4cb8-b3af-9314e8f6a0ba",
  "type": "character",
  "name": "Felix Leiter",
  "description": "CIA agent and close ally of James Bond.",
  "content": [
    {
      "title": "Background",
      "body": "Felix Leiter is an operative of the United States Central Intelligence Agency (CIA) and a recurring ally to James Bond. Introduced early in the Bond novels, he often provides intelligence support and assistance with cross-national operations."
    },
    {
      "title": "Personality",
      "body": "Leiter is portrayed as laid-back yet competent, representing the professional ally rather than a competitor to Bond. Their friendship is based on mutual respect, cooperation, and a shared goal of combating global threats."
    },
    {
      "title": "Role in Story",
      "body": "In 'Casino Royale' and other stories, Leiter aids Bond by providing intelligence, local contacts, and backup during operations. His presence symbolizes international cooperation between British and American intelligence."
    },
    {
      "title": "Relationships",
      "body": "Leiter shares a strong friendship and professional rapport with James Bond. He acts as a liaison between MI6 and the CIA, cooperating with M and other agencies to counter terrorism and espionage threats."
    },
    {
      "title": "Skills and Abilities",
      "body": "Felix Leiter is skilled in covert operations, firearms, and interrogation techniques. His American intelligence background complements Bond’s British training."
    }
  ],
  "aliases": [
    "Felix L.",
    "CIA Agent Felix Leiter"
  ],
  "relationships": [
    {
      "type": "ally_of",
      "target": "4b751a8e-3dce-4f29-8b1a-4e7db45a98fe"
    },
    {
      "type": "colleague_of",
      "target": "50fa1b1e-8679-4b51-9646-e429e7c9da31"
    }
  ],
  "properties": {
    "nationality": "American",
    "occupation": "CIA operative",
    "alliance": "United States"
  },
  "tags": [
    "CIA",
    "ally",
    "spy fiction",
    "James Bond franchise",
    "intelligence agent"
  ]
}