{
  "id": "7b3b796d-02f6-4e16-a55a-4b5f0b9db1e2",
  "type": "character",
  "name": "Miss Moneypenny",
  "description": "Personal secretary to M and confidante to James Bond.",
  "content": [
    {
      "title": "Background",
      "body": "Miss Moneypenny serves as the secretary to M, the head of MI6, supporting the administrative functions of the intelligence service. In 'Casino Royale' and the broader series, she also acts as a charming foil to James Bond, blending professionalism with flirtatious wit."
    },
    {
      "title": "Personality",
      "body": "She is portrayed as intelligent, capable, discreet, and loyal, often providing a warm yet teasing presence amidst the tense world of espionage. Her playful banter with Bond showcases mutual affection and respect."
    },
    {
      "title": "Story Role",
      "body": "Miss Moneypenny’s role bridges the administrative and operational sides of MI6, often serving as a sounding board or moral compass for Bond. While not a field agent, she adds depth to the world of espionage by humanizing the often distant intelligence apparatus."
    },
    {
      "title": "Relationships",
      "body": "She shares a professional relationship with M and a complex, mostly platonic relationship with James Bond, marked by flirtation without consummation. Her role symbolizes the emotional undercurrent often absent from Bond’s life."
    },
    {
      "title": "Skills and Abilities",
      "body": "Miss Moneypenny is highly organized, discreet, and skilled in communications and intelligence protocols. Her loyalty and discretion make her indispensable to MI6 operations."
    }
  ],
  "aliases": [
    "Moneypenny",
    "Miss Penny"
  ],
  "relationships": [
    {
      "type": "assistant_to",
      "target": "4d8ecfab-7db7-4e8c-a2ba-2e0dea54ce91"
    },
    {
      "type": "ally_of",
      "target": "4b751a8e-3dce-4f29-8b1a-4e7db45a98fe"
    },
    {
      "type": "member_of",
      "target": "50fa1b1e-8679-4b51-9646-e429e7c9da31"
    }
  ],
  "properties": {
    "position": "Secretary",
    "organization": "MI6",
    "role": "Support staff"
  },
  "tags": [
    "MI6",
    "secretary",
    "confidante",
    "spy fiction",
    "James Bond franchise"
  ]
}