{
  "id": "d1d75703-547e-4912-b4b9-c0f9312d7483",
  "type": "item",
  "name": "Walther PPK",
  "description": "Compact semi-automatic pistol famously used by James Bond.",
  "content": [
    {
      "title": "Overview",
      "body": "The Walther PPK is a compact, blowback-operated semi-automatic pistol manufactured by the German arms company Walther. Known for its reliability and concealability, it became the signature sidearm of James Bond in Ian Fleming’s novels and many film adaptations."
    },
    {
      "title": "Appearance",
      "body": "The pistol is small, with a sleek design featuring blued steel construction, a short barrel, and a fixed barrel design. Its compact frame allows concealed carry while maintaining effective stopping power."
    },
    {
      "title": "Function",
      "body": "Chambered typically in .32 ACP or .380 ACP, the PPK operates with a double-action/single-action trigger mechanism. Its simplicity and ease of use make it ideal for covert agents needing quick deployment in close quarters."
    },
    {
      "title": "History",
      "body": "Originally developed in the 1930s, the Walther PPK was considered a top choice for concealed carry pistols. Ian Fleming chose this pistol for Bond because he personally favored the model. Its association with Bond greatly increased its cultural significance."
    },
    {
      "title": "Story Significance",
      "body": "Bond’s use of the Walther PPK represents the agent’s blend of sophistication and practicality. The gun’s iconic status is closely tied to Bond’s image, often seen as a symbol of his lethal efficiency combined with discretion."
    }
  ],
  "aliases": [
    "PPK",
    "Walther PPK pistol"
  ],
  "relationships": [
    {
      "type": "used_by",
      "target": "4b751a8e-3dce-4f29-8b1a-4e7db45a98fe"
    }
  ],
  "properties": {
    "manufacturer": "Walther",
    "caliber": ".32 ACP / .380 ACP",
    "type": "Semi-automatic pistol",
    "introduced": "1931"
  },
  "tags": [
    "weapon",
    "firearm",
    "pistol",
    "James Bond",
    "iconic item",
    "spy gear"
  ]
}