{
  "id": "e5e8a4b9-2137-4f7c-9030-8d2c3e7f3521",
  "type": "person",
  "name": "Ian Fleming",
  "description": "British author and journalist, best known for creating the James Bond spy series.",
  "content": [
    {
      "title": "Biography",
      "body": "Ian Fleming was born in 1908 in London, United Kingdom. He was educated at Eton College, a prestigious school, and later attended the Royal Military College, Sandhurst. Fleming's early career involved journalism and work in British Naval Intelligence during World War II, experiences that heavily influenced his writing."
    },
    {
      "title": "Career",
      "body": "Fleming began his writing career shortly after World War II, initially working as a journalist and later turning to fiction. In 1953, he published 'Casino Royale,' the first novel featuring his iconic character James Bond. His writing style combined compelling spy thriller narratives with detailed descriptions of settings, weapons, and intricate plots. Fleming's major works revolve primarily around espionage and adventure themes, which set a benchmark in spy fiction."
    },
    {
      "title": "Notable Works",
      "body": "'Casino Royale' (1953), marking the debut of James Bond, introduced the world to the suave British secret agent and established a new genre of espionage thrillers. Other significant titles include 'Goldfinger,' 'From Russia, with Love,' and 'Dr. No.' These novels not only enjoyed massive success in print but also inspired a major film franchise that remains influential to this day."
    },
    {
      "title": "Legacy",
      "body": "Ian Fleming's creation of James Bond significantly impacted literature and popular culture, elevating spy fiction to mainstream popularity. The Bond novels have been adapted into one of the longest-running and most successful film series globally. Fleming's work influenced a generation of writers and filmmakers. Though he won no major literary awards, his novels' cultural reach remains immense, shaping spy fiction and cinematic adaptations."
    }
  ],
  "aliases": [
    "Ian Lancaster Fleming",
    "I. Fleming"
  ],
  "relationships": [],
  "properties": {
    "born": 1908,
    "died": 1964,
    "nationality": "British",
    "genres": [
      "spy fiction",
      "thriller",
      "adventure"
    ]
  },
  "tags": [
    "British authors",
    "20th century",
    "spy fiction",
    "thriller",
    "literary influence",
    "James Bond"
  ]
}