{
  "id": "e4f2568b-8c69-4e8a-9cf3-b12584970a29",
  "type": "character",
  "name": "Le Chiffre",
  "description": "A high-stakes gambler and financier for terrorist organizations, serving as the antagonist in Casino Royale.",
  "content": [
    {
      "title": "Background",
      "body": "**Le Chiffre** is a mysterious and enigmatic figure whose full origins and early life remain largely undisclosed within the narrative. Known primarily as a financier for terrorist groups, he manages their funds through illegal and risky ventures, including high-stakes gambling. His codename, 'Le Chiffre,' means 'The Cipher' or 'The Number' in French, reflecting his association with numbers, money, and secrecy. His life centers around maintaining and increasing his client's money through cunning and calculated risks."
    },
    {
      "title": "Personality",
      "body": "Le Chiffre is cold, calculating, and ruthless, with a striking combination of intelligence and cruelty. He displays an icy composure even under pressure but is shown to be vulnerable to physical pain and emotional strain due to his past, which elicits a sadistic streak. Motivated primarily by survival and greed, he gambles not just with money but with lives. His flaws include arrogance, a lack of empathy, and a tendency towards violent solutions when backed into a corner."
    },
    {
      "title": "Story Role",
      "body": "Le Chiffre appears as the primary antagonist in the novel and film *Casino Royale* (2006). He functions as the villain whose financial collapse drives the plot forward, orchestrating a deadly high-stakes poker game to recover lost money. He serves as the first major adversary to James Bond in the film's rebooted timeline. His arc concludes with his defeat and eventual death following the outcome of the poker tournament and Bond's deadly intervention."
    },
    {
      "title": "Relationships",
      "body": "- **James Bond:** His rival and nemesis, Bond is sent to neutralize Le Chiffre's threat by winning at the high-stakes poker game.\n- **M:** The head of MI6 who dispatches Bond to stop Le Chiffre.\n- **Terrorist Organizations:** Le Chiffre works as a banker to various terrorist entities, managing and attempting to secure their funds.\n- **Vesper Lynd:** Acts as a liaison and potential ally to Bond, indirectly affecting Le Chiffre's plans."
    },
    {
      "title": "Abilities",
      "body": "- Expert high-stakes gambler, specializing in poker.\n- Skilled financier with deep knowledge of illegal money laundering.\n- Adept at psychological manipulation and intimidation.\n- Physically resilient, although susceptible to torture and pain.\n- Fluent in multiple languages; displays cultured and refined tastes."
    }
  ],
  "aliases": [
    "Le Chiffre",
    "The Cipher",
    "The Number"
  ],
  "properties": {
    "species": "human",
    "occupation": "Financier and terrorist banker",
    "portrayed_by": "Mads Mikkelsen"
  },
  "tags": [
    "antagonist",
    "villain",
    "gambler",
    "terrorist financier",
    "poker player"
  ],
  "relationships": [
    {
      "type": "appears_in",
      "target": "9b1ab6a0-df91-4c86-8a72-8c23b7428298"
    },
    {
      "type": "rivals_with",
      "target": "4b751a8e-3dce-4f29-8b1a-4e7db45a98fe"
    }
  ]
}